MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_smbus.c
/**
  **********************************************************************************************************************
  * @file    stm32c5xx_hal_smbus.c
  * @brief   SMBUS HAL module driver.
  *          This file provides firmware functions to manage the following
  *          functionalities of the System Management Bus (SMBus) of the I2Cx peripheral,
  *          based on I2C principles of operation :
  *           + Initialization and de-initialization functions
  *           + IO operation functions
  *           + Peripheral State and Errors functions.
  *
  **********************************************************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  **********************************************************************************************************************
  */

/* Includes ----------------------------------------------------------------------------------------------------------*/
#include "stm32_hal.h"

/** @addtogroup STM32C5xx_HAL_Driver
  * @{
  */

#if defined(I2C1) || defined(I2C2)
#if defined(USE_HAL_SMBUS_MODULE) && (USE_HAL_SMBUS_MODULE == 1)

/** @addtogroup SMBUS SMBUS
  * @{
  */
/** @defgroup SMBUS_Introduction SMBUS Introduction
  * @{

  - The SMBUS hardware abstraction layer provides a set of APIs to interface with the STM32 SMBUS (System management
    bus) peripheral.

  - It simplifies the configuration, initialization and management of I2C communication, by supporting various modes
    such as polling and interrupt for data transfer.

  - This peripheral is compatible with the SMBUS specification version 3.0.

  - This abstraction layer ensures portability and ease of use across different STM32 series.

  */
/**
  * @}
  */

/** @defgroup SMBUS_How_To_Use SMBUS How To Use
  * @{

# How to use the SMBUS HAL module driver

1. Declare a hal_smbus_handle_t handle structure and initialize the SMBUSx driver
   with an I2C HW instance by calling the HAL_SMBUS_Init().
   The SMBUSx clock is enabled inside the HAL_SMBUS_Init() if USE_HAL_SMBUS_CLK_ENABLE_MODEL > HAL_CLK_ENABLE_NO.

2. Configure the low level hardware (GPIO, CLOCK, NVIC...etc):
  - Enable the SMBUSx clock if USE_HAL_SMBUS_CLK_ENABLE_MODEL = HAL_CLK_ENABLE_NO
  - SMBUSx pins configuration :
    - Enable the clock for the SMBUSx GPIOs
      - Configure SMBUSx pins as alternate function open-drain
    - NVIC configuration if you need to use interrupt process
      - Configure the SMBUSx interrupt priority
      - Enable the NVIC SMBUSx IRQ Channel

3. Configure the Communication Clock Timing (same calculation as I2C), Own Address1, Device mode by calling
   HAL_SMBUS_SetConfig.

4. Configure and/or enable advanced features. For instance, HAL_SMBUS_EnableAnalogFilter(),
   HAL_SMBUS_SetDigitalFilter(), HAL_SMBUS_SetConfigOwnAddress2(), HAL_SMBUS_EnableOwnAddress2(), ...APIs.
   All these advanced configurations are optional (not mandatory).

5. For SMBUSx IO operations modes, only interrupt is available within this driver as the SMBUS protocol requires the
   application to perform exchange with a byte granularity within the slave device.

  - Interrupt mode IO sequential operation.
      These interfaces allow to manage a sequential transfer with a repeated start condition when a direction change
      during transfer. A specific option field manages the different steps of a sequential transfer through
      @ref hal_smbus_xfer_opt_t and are listed below

    - XXXXXXXX_WITH_PEC suffix: Those options are activated by enabling Packet Error Check with
      HAL_SMBUS_EnablePacketErrorCheck() and allows for the Hardware PEC comparison to happen

    - XXXXXXXX_NO_PEC suffix: Those options are activated by default or by disabling Packet Error Check using
      HAL_SMBUS_DisablePacketErrorCheck() and avoid the Hardware PEC comparison to happen

    - HAL_SMBUS_XFER_FIRST_AND_LAST_FRAME: No sequential, means that a stop condition is automatically generated at the
      end of the single sequence.

    - HAL_SMBUS_XFER_FIRST_FRAME: Sequential, this option allows to manage a sequence with start condition, address and
      data to transfer without a final stop condition.

    - HAL_SMBUS_XFER_FIRST_AND_NEXT_FRAME: Sequential (Master only), this option allows to manage a sequence with start
      condition, address and data to transfer without a final stop condition. This allows a call to the same master
      sequential interface several times (HAL_SMBUS_MASTER_SEQ_Transmit_IT() followed by another call to
      HAL_SMBUS_MASTER_SEQ_Transmit_IT())

    - HAL_SMBUS_XFER_NEXT_FRAME: Sequential, this option allows to manage a sequence with a restart condition, address
      and with new data to transfer if the direction change or manage only the new data to transfer if no direction
      change and without a final stop condition in both cases.

    - HAL_SMBUS_XFER_LAST_FRAME: Sequential, same as HAL_SMBUS_XFER_NEXT_FRAME but with a final stop condition in
      both cases.

    - HAL_SMBUS_XFER_OTHER_FRAME: Sequential (Master only), this option allows to manage a restart condition after each
      call of the same master sequential interface. User can transfer several bytes one by one with a restart with slave
      address between each byte using
        - HAL_SMBUS_MASTER_SEQ_Transmit_IT()
        - HAL_SMBUS_MASTER_SEQ_Receive_IT()
      Then usage of this option HAL_SMBUS_XFER_OTHER_AND_LAST_FRAME at the last frame to help automatic
      generation of STOP condition.

  - Different sequential SMBUS interfaces are listed below:
    - Sequential transmit in master mode an amount of data in non-blocking mode using HAL_SMBUS_MASTER_SEQ_Transmit_IT()
    - At transmission end of current frame transfer, HAL_SMBUS_MASTER_TxCpltCallback() is executed and users can add
      their own code by customization of function pointer HAL_SMBUS_MASTER_TxCpltCallback()

    - Sequential receive in master SMBUS mode an amount of data in non-blocking mode using
      HAL_SMBUS_MASTER_SEQ_Receive_IT()
    - At reception end of current frame transfer, HAL_SMBUS_MASTER_RxCpltCallback() is executed and users can add their
      own code by customization of function pointer HAL_SMBUS_MASTER_RxCpltCallback()

    - Abort a master IT SMBUS process communication with Interrupt using HAL_SMBUS_MASTER_Abort_IT()
    - End of abort process, HAL_SMBUS_AbortCpltCallback() is executed and users can add their own code by customization
      of function pointer HAL_SMBUS_AbortCpltCallback()

    - Enable/disable the Address listen mode in slave SMBUS mode with HAL_SMBUS_SLAVE_EnableListen_IT() and
      HAL_SMBUS_SLAVE_DisableListen_IT()

