MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_smbus.c
    - When address slave SMBUS match, HAL_SMBUS_SLAVE_AddrCallback() is executed and users can add their own code to
      check the address Match Code and the transmission direction request by master(Write/Read).

    - At Listen mode end HAL_SMBUS_SLAVE_ListenCpltCallback() is executed and users can add their own code by
      customization of function pointer HAL_SMBUS_SLAVE_ListenCpltCallback()

    - Sequential transmit in slave SMBUS mode an amount of data in non-blocking mode using
      HAL_SMBUS_SLAVE_SEQ_Transmit_IT()

    - At transmission end of current frame transfer, HAL_SMBUS_SLAVE_TxCpltCallback() is executed and users can add
      their own code by customization of function pointer HAL_SMBUS_SLAVE_TxCpltCallback()

    - Sequential receive in slave SMBUS mode an amount of data in non-blocking mode using
      HAL_SMBUS_SLAVE_SEQ_Receive_IT()

    - At reception end of current frame transfer, HAL_SMBUS_SLAVE_RxCpltCallback() is executed and users can add their
      own code by customization of function pointer HAL_SMBUS_SLAVE_RxCpltCallback()

    - In case of transfer Error, HAL_SMBUS_ErrorCallback() function is executed and users can add their own code by
      customization of function pointer HAL_SMBUS_ErrorCallback()

    - Discard a slave SMBUS process communication using HAL_SMBUS_SLAVE_Abort_IT() macro. This action informs the Master
      to generate a Stop condition to discard the communication.

6. Callbacks definition in Interrupt
  - When the compilation define USE_HAL_SMBUS_REGISTER_CALLBACKS is set to 1, the user can configure dynamically the
    driver callbacks, via its own method:

  Callback name               | Default value                        | Callback registration function
  ----------------------------| ------------------------------------ | ---------------------------
  MASTER_TxCpltCallback       | HAL_SMBUS_MASTER_TxCpltCallback()    | HAL_SMBUS_MASTER_RegisterTxCpltCallback()
  MASTER_RxCpltCallback       | HAL_SMBUS_MASTER_RxCpltCallback()    | HAL_SMBUS_MASTER_RegisterRxCpltCallback()
  SLAVE_TxCpltCallback        | HAL_SMBUS_SLAVE_TxCpltCallback()     | HAL_SMBUS_SLAVE_RegisterTxCpltCallback()
  SLAVE_RxCpltCallback        | HAL_SMBUS_SLAVE_RxCpltCallback()     | HAL_SMBUS_SLAVE_RegisterRxCpltCallback()
  AddrMatchCallback           | HAL_SMBUS_SLAVE_AddrCallback()       | HAL_SMBUS_SLAVE_RegisterAddrMatchCallback()
  ListenCpltCallback          | HAL_SMBUS_SLAVE_ListenCpltCallback() | HAL_SMBUS_SLAVE_RegisterListenCpltCallback()
  AbortCpltCallback           | HAL_SMBUS_AbortCpltCallback()        | HAL_SMBUS_RegisterAbortCpltCallback()
  ErrorCallback               | HAL_SMBUS_ErrorCallback()            | HAL_SMBUS_RegisterErrorCallback()

  If one needs to unregister a callback, register the default callback via the registration function.

  By default, after the HAL_SMBUS_Init() and when the state is HAL_SMBUS_STATE_INIT, all callbacks are set to the
  corresponding default weak functions.

  Callbacks can be registered in handle global_state HAL_SMBUS_STATE_INIT and HAL_SMBUS_STATE_IDLE.

  When the compilation define USE_HAL_SMBUS_REGISTER_CALLBACKS is set to 0 or not defined, the callback registration
  feature is not available and weak callbacks are used, represented by the default value in the table above.

7. Acquire/Release the SMBUS bus
  - When the compilation flag USE_HAL_MUTEX is set to 1, it allows the user to acquire/reserve the whole I2C bus for
    executing process .
    The HAL Acquire/Release are based on the HAL OS abstraction layer (stm32_hal_os.c/.h osal) :
      - HAL_SMBUS_AcquireBus() for acquire the bus or wait for it.
      - HAL_SMBUS_ReleaseBus() for releasing the bus.

  - When the compilation flag USE_HAL_MUTEX is set to 0 or not defined, HAL_SMBUS_AcquireBus() and
    HAL_SMBUS_ReleaseBus() are not available.
  */
/**
  * @}
  */

/** @defgroup SMBUS_Configuration_Table SMBUS Configuration Table
  * @{
8. Configuration inside the SMBUS driver

Software configuration defined in stm32c5xx_hal_conf.h:
Preprocessor flags               |   Default value   | Comment
-------------------------------- | ----------------- | ------------------------------------------------
USE_HAL_SMBUS_MODULE             |         1         | Enable HAL SMBUS driver module
USE_HAL_SMBUS_REGISTER_CALLBACKS |         0         | Allow the user to define their own callback
USE_HAL_CHECK_PARAM              |         0         | Enable runtime parameter check
USE_HAL_SMBUS_CLK_ENABLE_MODEL   | HAL_CLK_ENABLE_NO | Enable the gating of the peripheral clock
USE_HAL_CHECK_PROCESS_STATE      |         0         | Enable atomicity of process state check
USE_HAL_MUTEX                    |         0         | Enable semaphore creation for OS
USE_HAL_SMBUS_USER_DATA          |         0         | Add a user data inside HAL SMBUS handle
USE_HAL_SMBUS_GET_LAST_ERRORS    |         0         | Enable retrieval of last processes error codes

Software configuration defined in preprocessor environment:
Preprocessor flags               |   Default value   | Comment
-------------------------------- | ----------------- | ------------------------------------------------
USE_ASSERT_DBG_PARAM             |    Not defined    | Enable check param for HAL and LL
USE_ASSERT_DBG_STATE             |    Not defined    | Enable check state for HAL

  */

/**
  * @}
  */

/* Private typedef ---------------------------------------------------------------------------------------------------*/
/** @defgroup SMBUS_Private_Types SMBUS Private Types
  * @{
  */

/**
  * @brief SMBUS Start or Stop Mode.
  */
typedef enum
{
  SMBUS_NO_STARTSTOP            = (0x00000000U),                               /*!< No start no stop */
  SMBUS_GENERATE_STOP           = (0x80000000U | I2C_CR2_STOP),                /*!< Stop */
  SMBUS_GENERATE_START_READ     = (0x80000000U | I2C_CR2_START | I2C_CR2_RD_WRN), /*!< Start read */
  SMBUS_GENERATE_START_WRITE    = (0x80000000U | I2C_CR2_START),               /*!< Start write */
} smbus_start_stop_mode_t;
/**
  * @}
  */
/* Private constants -------------------------------------------------------------------------------------------------*/
/** @defgroup SMBUS_Private_Constants SMBUS Private Constants
  * @{
  */
#define TIMING_CLEAR_MASK           (0xF0FFFFFFUL)              /*!< SMBUS TIMING clear register Mask */
#define SMBUS_DEFAULT_TIMEOUT_MS    (25U)                       /*!< 25 ms */
#define MAX_NBYTE_SIZE              (255U)                      /*!< SMBUS Max NBYTES */

