MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_smbus.c
/* Private define for @ref PreviousState usage */
#define SMBUS_STATE_NONE            (0U)                        /*!< Default Value */
#define SMBUS_STATE_MASTER_BUSY_TX  (1UL << 0U)                 /*!< Master Busy TX */
#define SMBUS_STATE_MASTER_BUSY_RX  (1UL << 1U)                 /*!< Master Busy RX */
#define SMBUS_STATE_SLAVE_BUSY_TX   (1UL << 2U)                 /*!< Slave Busy TX */
#define SMBUS_STATE_SLAVE_BUSY_RX   (1UL << 3U)                 /*!< Slave Busy RX */

/** @defgroup SMBUS_ReloadEndMode_definition SMBUS ReloadEndMode definition
  * @{
  */

#define  SMBUS_SOFTEND_MODE                     (0x00000000U)   /*!< Software end mode and Reload mode */
#define  SMBUS_RELOAD_MODE                      I2C_CR2_RELOAD  /*!< Reload mode */
#define  SMBUS_AUTOEND_MODE                     I2C_CR2_AUTOEND /*!< Hardware auto end and reload mode */
#define  SMBUS_SENDPEC_MODE                     I2C_CR2_PECBYTE /*!< Packet Error Calculation mode */
/**
  * @}
  */

/** @defgroup SMBUS_Interrupt_configuration_mask SMBUS interrupt configuration mask
  * @{
  */

/**
  * @brief Interrupt Mask for error, Tx cplt, Stop, NACK and Tx.
  */
#define SMBUS_TX_IT_MASK                        (LL_I2C_CR1_ERRIE | LL_I2C_CR1_TCIE | LL_I2C_CR1_STOPIE | \
                                                 LL_I2C_CR1_NACKIE | LL_I2C_CR1_TXIE)
/**
  * @brief Interrupt Mask for error, Tx cplt, NACK and Rx.
  */
#define SMBUS_RX_IT_MASK                        (LL_I2C_CR1_ERRIE | LL_I2C_CR1_TCIE | LL_I2C_CR1_NACKIE | \
                                                 LL_I2C_CR1_RXIE)
/**
  * @brief Interrupt Mask for error.
  */
#define SMBUS_ALERT_IT_MASK                     (LL_I2C_CR1_ERRIE)

/**
  * @brief Interrupt Mask for error, Tx cplt, NACK and Rx.
  */
#define SMBUS_ADDR_IT_MASK                      (LL_I2C_CR1_ADDRIE | LL_I2C_CR1_STOPIE | LL_I2C_CR1_NACKIE)
/**
  * @}
  */
/**
  * @}
  */

/* Private macros -------------------------------------------------------------*/
/** @defgroup SMBUS_Private_Macros SMBUS Private Macros
  * @{
  */
/**
  * @brief  Retrieve I2C instance from handle.
  * @param  handle from which instance has to be retrieved, must be from @ref hal_smbus_handle_t.
  * @retval Instance pointer
  */
#define I2C_GET_INSTANCE(handle)        ((I2C_TypeDef *)((uint32_t)(handle)->instance))

/**
  * @brief  Ensure that transfer request is valid.
  * @param  request Request to test, must be from @ref smbus_start_stop_mode_t.
  * @retval 1U (request is valid) or 0U (request is invalid)
  */
#define IS_TRANSFER_REQUEST(request)    (((request) == SMBUS_GENERATE_STOP)               \
                                         || ((request) == SMBUS_GENERATE_START_READ)      \
                                         || ((request) == SMBUS_GENERATE_START_WRITE)     \
                                         || ((request) == SMBUS_NO_STARTSTOP))

/**
  * @brief  Ensure that SMBUS mode is valid.
  * @param  mode mode to test, must be from @ref hal_smbus_mode_t.
  * @retval 1U (mode is valid) or 0U (mode is invalid)
  */
#define IS_SMBUS_MODE(mode)          (((mode) == HAL_SMBUS_PERIPHERAL_MODE_HOST)         \
                                      || ((mode) == HAL_SMBUS_PERIPHERAL_MODE_SLAVE)     \
                                      || ((mode) == HAL_SMBUS_PERIPHERAL_MODE_SLAVE_ARP))

/**
  * @brief  Ensure that SMBUS timeout is valid.
  * @param  timeout timeout to test, must be from @ref hal_smbus_timeout_t.
  * @retval 1U (timeout is valid) or 0U (timeout is invalid)
  */
#define IS_SMBUS_TIMEOUT(timeout)    (((timeout) == HAL_SMBUS_TIMEOUT_NONE)    \
                                      || ((timeout) == HAL_SMBUS_TIMEOUT_A)    \
                                      || ((timeout) == HAL_SMBUS_TIMEOUT_B)    \
                                      || ((timeout) == HAL_SMBUS_TIMEOUT_ALL))

/**
  * @brief  Ensure that SMBUS timeout value is valid.
  * @param  value timeout value to test.
  * @retval 1U (value is valid) or 0U (value is invalid)
  */
#define IS_SMBUS_TIMEOUT_VALUE(value)    ((value) <= 0x0000FFFU)

/**
  * @brief  Ensure that SMBUS timeout A mode is valid.
  * @param  mode timeout mode to test, must be from @ref hal_smbus_timeout_a_mode_t.
  * @retval 1U (mode is valid) or 0U (mode is invalid)
  */
#define IS_SMBUS_TIMEOUT_MODE(mode)   (((mode) == HAL_SMBUS_TIMEOUTA_MODE_SCL_LOW)     \
                                       || ((mode) == HAL_SMBUS_TIMEOUTA_MODE_SDA_SCL_HIGH))

/**
  * @brief  Ensure that SMBUS own address mask is valid.
  * @param  mask mask to test, must be from @ref hal_smbus_own_addr2_mask_t.
  * @retval 1U (mask is valid) or 0U (mask is invalid)
  */
#define IS_SMBUS_OWN_ADDRESS2_MASK(mask)  (((mask) == HAL_SMBUS_OWN_ADDR2_NOMASK)      \
                                           || ((mask) == HAL_SMBUS_OWN_ADDR2_MASK01)   \
                                           || ((mask) == HAL_SMBUS_OWN_ADDR2_MASK02)   \
                                           || ((mask) == HAL_SMBUS_OWN_ADDR2_MASK03)   \
                                           || ((mask) == HAL_SMBUS_OWN_ADDR2_MASK04)   \
                                           || ((mask) == HAL_SMBUS_OWN_ADDR2_MASK05)   \
                                           || ((mask) == HAL_SMBUS_OWN_ADDR2_MASK06)   \
                                           || ((mask) == HAL_SMBUS_OWN_ADDR2_MASK07))

/**
  * @brief  Ensure that SMBUS transfer request is valid.
  * @param  req transfer request to test, must be from @ref hal_smbus_xfer_opt_t.
  * @retval 1U (request is valid) or 0U (request is invalid)
  */
#define IS_SMBUS_TRANSFER_OPTIONS_REQUEST(req)(((req) == HAL_SMBUS_XFER_FIRST_FRAME)              \
                                               || ((req) == HAL_SMBUS_XFER_NEXT_FRAME)            \
                                               ||IS_SMBUS_TRANSFER_NOPEC_OPTIONS_REQUEST(req)     \
                                               ||IS_SMBUS_TRANSFER_PEC_OPTIONS_REQUEST(req))

/**
  * @brief  Ensure that SMBUS transfer request has PEC enabled.
  * @param  req transfer request to test, must be from @ref hal_smbus_xfer_opt_t.
  * @retval 1U (request with PEC) or 0U (request without PEC)
  */
#define IS_SMBUS_TRANSFER_PEC_OPTIONS_REQUEST(req) (((req) == HAL_SMBUS_XFER_FIRST_AND_LAST_FRAME_WITH_PEC)    \
                                                    || ((req) == HAL_SMBUS_XFER_OTHER_FRAME_WITH_PEC)          \
                                                    || ((req) == HAL_SMBUS_XFER_OTHER_AND_LAST_FRAME_WITH_PEC))

/**
  * @brief  Ensure that SMBUS transfer request has PEC disabled.
  * @param  req transfer request to test, must be from @ref hal_smbus_xfer_opt_t.
  * @retval 1U (request without PEC) or 0U (request with PEC)
  */
#define IS_SMBUS_TRANSFER_NOPEC_OPTIONS_REQUEST(req) (((req) == HAL_SMBUS_XFER_FIRST_AND_LAST_FRAME_NO_PEC)    \
                                                      || ((req) == HAL_SMBUS_XFER_OTHER_FRAME_NO_PEC)          \
                                                      || ((req) == HAL_SMBUS_XFER_OTHER_AND_LAST_FRAME_NO_PEC))

/**
  * @brief  Ensure that SMBUS transfer request is of OTHER type.
  * @param  req transfer request to test, must be from @ref hal_smbus_xfer_opt_t.
  * @retval 1U (request with OTHER) or 0U (request without OTHER)
  */
#define IS_SMBUS_TRANSFER_OTHER_OPTIONS_REQUEST(req) (((req) == HAL_SMBUS_XFER_OTHER_FRAME_NO_PEC)              \
                                                      || ((req) == HAL_SMBUS_XFER_OTHER_AND_LAST_FRAME_NO_PEC)  \
                                                      || ((req) == HAL_SMBUS_XFER_OTHER_FRAME_WITH_PEC)         \
                                                      || ((req) == HAL_SMBUS_XFER_OTHER_AND_LAST_FRAME_WITH_PEC))

/**
  * @brief  Get Address match macro.
  * @param  handle SMBUS handle.
  * @retval address match
  */
#define SMBUS_GET_ADDR_MATCH(handle) \
  ((uint32_t)((((I2C_TypeDef *)((uint32_t)(handle)->instance))->ISR & I2C_ISR_ADDCODE)  >> I2C_ISR_ADDCODE_Pos))

/**
  * @brief  Get dir macro.
  * @param  handle SMBUS handle.
  * @retval dir value
  */
#define SMBUS_GET_DIR(handle) \
  ((uint8_t)((((I2C_TypeDef *)((uint32_t)(handle)->instance))->ISR & I2C_ISR_DIR) >> 16U))

/**
  * @brief  Get Stop mode macro.
  * @param  handle SMBUS handle.
  * @retval Stop mode
  */
#define SMBUS_GET_STOP_MODE(handle) (((I2C_TypeDef *)((uint32_t)(handle)->instance))->CR2 & I2C_CR2_AUTOEND)

/**
  * @brief  Get own address1 macro.
  * @param  handle SMBUS handle.
  * @retval own address1
  */
#define SMBUS_GET_OWN_ADDRESS1(handle) \
  ((uint32_t)(((I2C_TypeDef *)((uint32_t)(handle)->instance))->OAR1 & I2C_OAR1_OA1))

/**
  * @brief  Get own address2 macro.
  * @param  handle SMBUS handle.
  * @retval own address2
  */
#define SMBUS_GET_OWN_ADDRESS2(handle) \
  ((uint32_t)(((I2C_TypeDef *)((uint32_t)(handle)->instance))->OAR2 & I2C_OAR2_OA2))

/**
  * @brief  Ensure that SMBUS address is valid.
  * @param  address SMBUS address.
  * @retval 1U (address is valid) or 0U (address is invalid)
  */
#define IS_SMBUS_ADDRESS(address)    ((address) <= 0x00000FFU)

/**
  * @brief  Ensure that SMBUS digital filter is valid.
  * @param  filter SMBUS filter value.
  * @retval 1U (filter is valid) or 0U (filter is invalid)
  */
#define IS_SMBUS_DIGITAL_FILTER(filter)   ((filter) <= 0x0000000FU)


/**
  * @brief  Check if the given flag is raised in the given ISR register.
  * @param  isr ISR register.
  * @param  flag ISR flag to check.
  * @retval 1U (flag is raised) or 0U (flag is not raised)
  */
#define SMBUS_CHECK_FLAG(isr, flag)         ((((isr) & ((flag) & (0x0001FFFFU)))  \
                                              == ((flag) & 0x0001FFFFU)) ? 1U : 0U)

/**
  * @brief  Check if the given IT is enabled in the given CR1 register.
  * @param  cr1 CR1 register.
  * @param  it IT to check.
  * @retval 1U (IT is enabled) or 0U (it is disabled)
  */
#define SMBUS_CHECK_IT_SOURCE(cr1, it)      ((((cr1) & (it)) == (it)) ? 1U : 0U)

/**
  * @brief  Reset the CR1 register of the given instance.
  * @param  instance SMBUS instance.
  */
#define I2C_RESET_CR2(instance) ((instance)->CR2 &= (uint32_t)~((uint32_t)(I2C_CR2_SADD   | I2C_CR2_HEAD10R  \
                                                                           | I2C_CR2_NBYTES | I2C_CR2_RELOAD \
                                                                           | I2C_CR2_RD_WRN)))
/**
  * @}
  */
/* Private variables -------------------------------------------------------------------------------------------------*/
/* Private function prototypes ---------------------------------------------------------------------------------------*/
/** @addtogroup SMBUS_Private_Functions SMBUS Private Functions
  * @{
  */
/* Private functions to handle flags during polling transfer */
static hal_status_t SMBUS_WaitOnFlagUntilTimeout(hal_smbus_handle_t *hsmbus, uint32_t flag, uint32_t status,
                                                 uint32_t timeout_ms, uint32_t tick_start);

/* Private functions for SMBUS transfer IRQ handler */
static hal_status_t SMBUS_Master_ISR(hal_smbus_handle_t *hsmbus, uint32_t it_flags, uint32_t it_sources);
static hal_status_t SMBUS_Slave_ISR(hal_smbus_handle_t *hsmbus, uint32_t it_flags, uint32_t it_sources);
static void SMBUS_ITErrorHandler(hal_smbus_handle_t *hsmbus);

/* Private functions to centralize the enable/disable of Interrupts */
static void SMBUS_Enable_IRQ(hal_smbus_handle_t *hsmbus, uint32_t it_request);
static void SMBUS_Disable_IRQ(hal_smbus_handle_t *hsmbus, uint32_t it_request);

/* Private function to flush TXDR register */
static void SMBUS_Flush_TXDR(hal_smbus_handle_t *hsmbus);

/* Private function to handle start, restart or stop a transfer */
static void SMBUS_TransferConfig(I2C_TypeDef *p_i2cx,  uint32_t device_addr, uint32_t size_byte,
                                 uint32_t mode, smbus_start_stop_mode_t request);

/* Private function to convert specific options */
static void SMBUS_ConvertOtherXferOptions(hal_smbus_handle_t *hsmbus);
/**
  * @}
  */

/* Exported functions ------------------------------------------------------------------------------------------------*/

/** @addtogroup SMBUS_Exported_Functions
  * @{
  */

