MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_smbus.c
/** @addtogroup SMBUS_Exported_Functions_Group1
  * @{
A set of functions to initialize and deinitialize the SMBUSx functionality in the I2Cx peripheral:
 - HAL_SMBUS_Init(): initialize the selected device with the SMBUS instance.
 - HAL_SMBUS_DeInit(): restore the default configuration of the selected SMBUSx functionality in the I2Cx peripheral.
  */

/**
  * @brief  Initialize the SMBUS according to the associated handle.
  * @param  hsmbus Pointer to a @ref hal_smbus_handle_t.
  * @param  instance HAL SMBUS instance.
  * @retval HAL_OK HAL SMBUS instance has been correctly initialized.
  * @retval HAL_INVALID_PARAM HAL SMBUS instance is NULL.
  * @retval HAL_ERROR HAL SMBUS semaphore creation failed (USE_HAL_MUTEX is set to 1).
  */
hal_status_t HAL_SMBUS_Init(hal_smbus_handle_t *hsmbus, hal_smbus_t instance)
{
  ASSERT_DBG_PARAM((hsmbus != NULL));
  ASSERT_DBG_PARAM(IS_SMBUS_ALL_INSTANCE((I2C_TypeDef *)((uint32_t)instance)));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (hsmbus == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  /* Instance */
  hsmbus->instance = instance;

#if defined (USE_HAL_SMBUS_REGISTER_CALLBACKS) && (USE_HAL_SMBUS_REGISTER_CALLBACKS == 1)
  /* I2C Callbacks to the weak function */
  hsmbus->p_master_tx_cplt_cb    = HAL_SMBUS_MASTER_TxCpltCallback;
  hsmbus->p_master_rx_cplt_cb    = HAL_SMBUS_MASTER_RxCpltCallback;
  hsmbus->p_slave_tx_cplt_cb     = HAL_SMBUS_SLAVE_TxCpltCallback;
  hsmbus->p_slave_rx_cplt_cb     = HAL_SMBUS_SLAVE_RxCpltCallback;
  hsmbus->p_slave_listen_cplt_cb = HAL_SMBUS_SLAVE_ListenCpltCallback;
  hsmbus->p_slave_addr_cb        = HAL_SMBUS_SLAVE_AddrCallback;
  hsmbus->p_abort_cplt_cb        = HAL_SMBUS_AbortCpltCallback;
  hsmbus->p_error_cb             = HAL_SMBUS_ErrorCallback;
#endif /* USE_HAL_SMBUS_REGISTER_CALLBACKS */

  /* Other internal fields */
  hsmbus->p_buf_tx = (uint8_t *) NULL;
  hsmbus->p_buf_rx = (uint8_t *) NULL;
  hsmbus->xfer_size = 0U;
  hsmbus->xfer_count = 0U;
  hsmbus->xfer_opt = (hal_smbus_xfer_opt_t) 0U;
  hsmbus->xfer_isr = NULL;

  hsmbus->last_error_codes = HAL_SMBUS_ERROR_NONE;

#if defined (USE_HAL_SMBUS_USER_DATA) && (USE_HAL_SMBUS_USER_DATA == 1)
  hsmbus->p_user_data = (void *) NULL;
#endif /* USE_HAL_SMBUS_USER_DATA */

#if defined(USE_HAL_SMBUS_CLK_ENABLE_MODEL) && (USE_HAL_SMBUS_CLK_ENABLE_MODEL > HAL_CLK_ENABLE_NO)
  /* Enable I2Cx Clock */
  switch (instance)
  {
    case HAL_SMBUS1:
      HAL_RCC_I2C1_EnableClock();
      break;
#if defined(I2C2)
    case HAL_SMBUS2:
      HAL_RCC_I2C2_EnableClock();
      break;
#endif /* I2C2 */
    default:
      break;
  }
#endif /* USE_HAL_SMBUS_CLK_ENABLE_MODEL > HAL_CLK_ENABLE_NO */

#if defined(USE_HAL_MUTEX) && (USE_HAL_MUTEX == 1)
  /* Create the SMBUS semaphore */
  if (HAL_OS_SemaphoreCreate(&hsmbus->semaphore) != HAL_OS_OK)
  {
    return HAL_ERROR;
  }
#endif /* USE_HAL_MUTEX */

  hsmbus->global_state = HAL_SMBUS_STATE_INIT;

  return HAL_OK;
}

/**
  * @brief  Deinitialize the HAL SMBUS driver for the given handle and disable the SMBUSx functionality in
  *         the I2Cx peripheral.
  * @param  hsmbus Pointer to a @ref hal_smbus_handle_t structure.
  */
void HAL_SMBUS_DeInit(hal_smbus_handle_t *hsmbus)
{
  I2C_TypeDef *p_i2cx;
  hal_smbus_state_t temp_state;
  uint32_t count = SMBUS_DEFAULT_TIMEOUT_MS;

  ASSERT_DBG_PARAM((hsmbus != NULL));
  ASSERT_DBG_PARAM(IS_SMBUS_ALL_INSTANCE((I2C_TypeDef *)((uint32_t)hsmbus->instance)));

  /* Get the I2Cx CMSIS handle */
  p_i2cx = I2C_GET_INSTANCE(hsmbus);

  temp_state = hsmbus->global_state;

  if ((temp_state != HAL_SMBUS_STATE_IDLE) && (temp_state != HAL_SMBUS_STATE_INIT))
  {
    if (LL_I2C_GetMode(p_i2cx) == (uint32_t)HAL_SMBUS_PERIPHERAL_MODE_HOST)
    {
      LL_I2C_GenerateStopCondition(p_i2cx);
    }
    else
    {
      LL_I2C_AcknowledgeNextData(p_i2cx, LL_I2C_NACK);
    }

    do
    {
      count--;
      if (count == 0U)
      {
        break;
      }
    } while (LL_I2C_IsActiveFlag_STOP(p_i2cx) == 0U);
  }

  /* Disable the I2C instance */
  LL_I2C_Disable(p_i2cx);

#if defined(USE_HAL_MUTEX) && (USE_HAL_MUTEX == 1)
  /* Delete the SMBUS semaphore */
  (void)HAL_OS_SemaphoreDelete(&hsmbus->semaphore);
#endif /* USE_HAL_MUTEX */

  /* Reset the state */
  hsmbus->global_state = HAL_SMBUS_STATE_RESET;
}
/**
  * @}
  */

/** @addtogroup SMBUS_Exported_Functions_Group2
  * @{
A set of functions to configure the I2Cx peripheral in SMBUS:

- Global configuration:
  - HAL_SMBUS_SetConfig()
  - HAL_SMBUS_GetConfig()

- Unitary configuration:
  - HAL_SMBUS_SetTiming()
  - HAL_SMBUS_GetTiming()

- Timeout configuration:
  - HAL_SMBUS_SetConfigTimeout()
  - HAL_SMBUS_GetConfigTimeout()
  - HAL_SMBUS_EnableTimeout()
  - HAL_SMBUS_DisableTimeout()
  - HAL_SMBUS_IsEnabledTimeoutA()
  - HAL_SMBUS_IsEnabledTimeoutB()

- Filter mode:
  - HAL_SMBUS_EnableAnalogFilter()
  - HAL_SMBUS_DisableAnalogFilter()
  - HAL_SMBUS_IsEnabledAnalogFilter()
  - HAL_SMBUS_SetDigitalFilter()
  - HAL_SMBUS_GetDigitalFilter()

- Acknowledge General Call:
  - HAL_SMBUS_SLAVE_EnableAckGeneralCall()
  - HAL_SMBUS_SLAVE_DisableAckGeneralCall()
  - HAL_SMBUS_SLAVE_IsEnabledAckGeneralCall()

- Second Own Address configuration :
  - HAL_SMBUS_SetConfigOwnAddress2()
  - HAL_SMBUS_GetConfigOwnAddress2()
  - HAL_SMBUS_EnableOwnAddress2()
  - HAL_SMBUS_DisableOwnAddress2()
  - HAL_SMBUS_IsEnabledOwnAddress2()

- Packet Error Check :
  - HAL_SMBUS_EnablePacketErrorCheck()
  - HAL_SMBUS_DisablePacketErrorCheck()
  - HAL_SMBUS_IsEnabledPacketErrorCheck()

- Alert interrupt:
  - HAL_SMBUS_MASTER_EnableAlertIT()
  - HAL_SMBUS_MASTER_DisableAlertIT()
  - HAL_SMBUS_MASTER_IsEnabledAlertIT()

- Wakeup from Stop mode(s) :
  - HAL_SMBUS_SLAVE_EnableWakeUp()
  - HAL_SMBUS_SLAVE_DisableWakeUp()
  - HAL_SMBUS_SLAVE_IsEnabledWakeUp()

- Fast mode plus driving capability:
  - HAL_SMBUS_EnableFastModePlus()
  - HAL_SMBUS_DisableFastModePlus()
  - HAL_SMBUS_IsEnabledFastModePlus()

  */

/**
  * @brief  Configure the SMBUS according to the user parameters.
  * @param  hsmbus Pointer to a @ref hal_smbus_handle_t.
  * @param  p_config Pointer to the configuration structure.
  * @retval HAL_OK Operation completed successfully.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  */
hal_status_t HAL_SMBUS_SetConfig(hal_smbus_handle_t *hsmbus, const hal_smbus_config_t *p_config)
{
  I2C_TypeDef *p_i2cx;

  ASSERT_DBG_PARAM((hsmbus != NULL));
  ASSERT_DBG_PARAM((p_config != NULL));
  ASSERT_DBG_PARAM(IS_SMBUS_MODE(p_config->device_mode));
  ASSERT_DBG_PARAM(IS_SMBUS_ADDRESS(p_config->own_address1));

  ASSERT_DBG_STATE(hsmbus->global_state, (uint32_t)HAL_SMBUS_STATE_INIT | (uint32_t)HAL_SMBUS_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

