MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_smbus.c
  p_i2cx = I2C_GET_INSTANCE(hsmbus);
  LL_I2C_Disable(p_i2cx);

  LL_I2C_SetTiming(p_i2cx, p_config->timing);
  LL_I2C_SetMode(p_i2cx, (uint32_t)p_config->device_mode);
  LL_I2C_DisableOwnAddress1AndMode(p_i2cx);
  LL_I2C_ConfigOwnAddress1(p_i2cx, p_config->own_address1, LL_I2C_OWNADDRESS1_7BIT);

  /* Enable the I2Cx AUTOEND by default, and enable NACK (must be disabled only during slave process). */
  LL_I2C_WRITE_REG(p_i2cx, CR2, (LL_I2C_READ_REG(p_i2cx, CR2) | I2C_CR2_AUTOEND | I2C_CR2_NACK));

  LL_I2C_Enable(p_i2cx);

  hsmbus->global_state = HAL_SMBUS_STATE_IDLE;

  return HAL_OK;
}

/**
  * @brief  Retrieve the SMBUS configuration.
  * @param  hsmbus Pointer to a @ref hal_smbus_handle_t.
  * @param  p_config Pointer to the configuration structure.
  */
void HAL_SMBUS_GetConfig(const hal_smbus_handle_t *hsmbus, hal_smbus_config_t *p_config)
{
  I2C_TypeDef *p_i2cx;

  ASSERT_DBG_PARAM((hsmbus != NULL));
  ASSERT_DBG_PARAM((p_config != NULL));

  ASSERT_DBG_STATE(hsmbus->global_state, (uint32_t)HAL_SMBUS_STATE_IDLE | (uint32_t)HAL_SMBUS_STATE_TX
                   | (uint32_t)HAL_SMBUS_STATE_RX | (uint32_t)HAL_SMBUS_STATE_LISTEN
                   | (uint32_t)HAL_SMBUS_STATE_RX_LISTEN | (uint32_t)HAL_SMBUS_STATE_TX_LISTEN
                   | (uint32_t)HAL_SMBUS_STATE_ABORT);

  p_i2cx = I2C_GET_INSTANCE(hsmbus);

  p_config->timing = LL_I2C_GetTiming(p_i2cx);

  p_config->device_mode = (hal_smbus_mode_t)LL_I2C_GetMode(p_i2cx);

  p_config->own_address1 = LL_I2C_GetOwnAddress1(p_i2cx);
}

/**
  * @brief  Set the SMBUS Timing.
  * @param  hsmbus Pointer to a @ref hal_smbus_handle_t
  * @param  value SMBUS timing
  * @retval HAL_OK Operation completed successfully
  */
hal_status_t HAL_SMBUS_SetTiming(hal_smbus_handle_t *hsmbus, uint32_t value)
{
  I2C_TypeDef *p_i2cx;

  ASSERT_DBG_PARAM((hsmbus != NULL));

  ASSERT_DBG_STATE(hsmbus->global_state, (uint32_t)HAL_SMBUS_STATE_IDLE);

  p_i2cx = I2C_GET_INSTANCE(hsmbus);

  LL_I2C_Disable(p_i2cx);
  LL_I2C_SetTiming(p_i2cx, value);
  LL_I2C_Enable(p_i2cx);

  return HAL_OK;
}

/**
  * @brief  Get the SMBUS Timing.
  * @param  hsmbus Pointer to a @ref hal_smbus_handle_t
  * @retval uint32_t SMBUS timing value
  */
uint32_t HAL_SMBUS_GetTiming(const hal_smbus_handle_t *hsmbus)
{
  I2C_TypeDef *p_i2cx;

  ASSERT_DBG_PARAM((hsmbus != NULL));

  ASSERT_DBG_STATE(hsmbus->global_state, (uint32_t)HAL_SMBUS_STATE_IDLE | (uint32_t)HAL_SMBUS_STATE_TX
                   | (uint32_t)HAL_SMBUS_STATE_RX | (uint32_t)HAL_SMBUS_STATE_LISTEN
                   | (uint32_t)HAL_SMBUS_STATE_RX_LISTEN | (uint32_t)HAL_SMBUS_STATE_TX_LISTEN
                   | (uint32_t)HAL_SMBUS_STATE_ABORT);

  p_i2cx = I2C_GET_INSTANCE(hsmbus);

  return LL_I2C_GetTiming(p_i2cx);
}

/**
  * @brief  Enable SMBUS Analog noise filter.
  * @param  hsmbus Pointer to a @ref hal_smbus_handle_t
  * @retval HAL_OK Operation completed successfully
  */
hal_status_t HAL_SMBUS_EnableAnalogFilter(hal_smbus_handle_t *hsmbus)
{
  I2C_TypeDef *p_i2cx;

  ASSERT_DBG_PARAM((hsmbus != NULL));

  ASSERT_DBG_STATE(hsmbus->global_state, (uint32_t)HAL_SMBUS_STATE_IDLE);

  p_i2cx = I2C_GET_INSTANCE(hsmbus);

  LL_I2C_Disable(p_i2cx);
  LL_I2C_EnableAnalogFilter(p_i2cx);
  LL_I2C_Enable(p_i2cx);

  return HAL_OK;
}

/**
  * @brief  Disable SMBUS Analog noise filter.
  * @param  hsmbus Pointer to a @ref hal_smbus_handle_t
  * @retval HAL_OK Operation completed successfully
  */
hal_status_t HAL_SMBUS_DisableAnalogFilter(hal_smbus_handle_t *hsmbus)
{
  I2C_TypeDef *p_i2cx;

  ASSERT_DBG_PARAM((hsmbus != NULL));

  ASSERT_DBG_STATE(hsmbus->global_state, (uint32_t)HAL_SMBUS_STATE_IDLE);

  p_i2cx = I2C_GET_INSTANCE(hsmbus);

  LL_I2C_Disable(p_i2cx);
  LL_I2C_DisableAnalogFilter(p_i2cx);
  LL_I2C_Enable(p_i2cx);

  return HAL_OK;
}

/**
  * @brief  Check SMBUS analog noise filter status.
  * @param  hsmbus Pointer to a @ref hal_smbus_handle_t
  * @retval HAL_SMBUS_ANALOG_FILTER_ENABLED  Analog Filter is enabled
  * @retval HAL_SMBUS_ANALOG_FILTER_DISABLED Analog Filter is disabled
  */
hal_smbus_analog_filter_status_t HAL_SMBUS_IsEnabledAnalogFilter(const hal_smbus_handle_t *hsmbus)
{
  I2C_TypeDef *p_i2cx;

  ASSERT_DBG_PARAM((hsmbus != NULL));

  ASSERT_DBG_STATE(hsmbus->global_state, (uint32_t)HAL_SMBUS_STATE_IDLE | (uint32_t)HAL_SMBUS_STATE_TX
                   | (uint32_t)HAL_SMBUS_STATE_RX | (uint32_t)HAL_SMBUS_STATE_LISTEN
                   | (uint32_t)HAL_SMBUS_STATE_RX_LISTEN | (uint32_t)HAL_SMBUS_STATE_TX_LISTEN
                   | (uint32_t)HAL_SMBUS_STATE_ABORT);

  p_i2cx = I2C_GET_INSTANCE(hsmbus);

  return (hal_smbus_analog_filter_status_t) LL_I2C_IsEnabledAnalogFilter(p_i2cx);
}

/**
  * @brief  Set the SMBUS Digital noise filter.
  * @param  hsmbus Pointer to a @ref hal_smbus_handle_t
  * @param  noise_filtering_in_bus_clk_period Filtering period between Min_Data=0x00 and Max_Data=0x0F.
  * @retval HAL_OK Operation completed successfully
  */
hal_status_t HAL_SMBUS_SetDigitalFilter(hal_smbus_handle_t *hsmbus, uint32_t noise_filtering_in_bus_clk_period)
{
  I2C_TypeDef *p_i2cx;

  ASSERT_DBG_PARAM((hsmbus != NULL));
  ASSERT_DBG_PARAM(IS_SMBUS_DIGITAL_FILTER(noise_filtering_in_bus_clk_period));

  ASSERT_DBG_STATE(hsmbus->global_state, (uint32_t)HAL_SMBUS_STATE_IDLE);

  p_i2cx = I2C_GET_INSTANCE(hsmbus);

  LL_I2C_Disable(p_i2cx);
  LL_I2C_SetDigitalFilter(p_i2cx, noise_filtering_in_bus_clk_period);
  LL_I2C_Enable(p_i2cx);

  return HAL_OK;
}

/**
  * @brief  Get the SMBUS Digital noise filter.
  * @param  hsmbus Pointer to a @ref hal_smbus_handle_t
  * @retval uint32_t Coefficient of digital noise filter between Min_Data=0x00 and Max_Data=0x0F.
  */
uint32_t HAL_SMBUS_GetDigitalFilter(const hal_smbus_handle_t *hsmbus)
{
  I2C_TypeDef *p_i2cx;

  ASSERT_DBG_PARAM((hsmbus != NULL));

  ASSERT_DBG_STATE(hsmbus->global_state, (uint32_t)HAL_SMBUS_STATE_IDLE | (uint32_t)HAL_SMBUS_STATE_TX
                   | (uint32_t)HAL_SMBUS_STATE_RX | (uint32_t)HAL_SMBUS_STATE_LISTEN
                   | (uint32_t)HAL_SMBUS_STATE_RX_LISTEN | (uint32_t)HAL_SMBUS_STATE_TX_LISTEN
                   | (uint32_t)HAL_SMBUS_STATE_ABORT);

