MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_smbus.c
  p_i2cx = I2C_GET_INSTANCE(hsmbus);

  return LL_I2C_GetDigitalFilter(p_i2cx);
}

/**
  * @brief  Enable SMBUS Slave wakeup from Stop mode(s).
  * @param  hsmbus Pointer to a @ref hal_smbus_handle_t
  * @retval HAL_OK Operation completed successfully
  */
hal_status_t HAL_SMBUS_SLAVE_EnableWakeUp(hal_smbus_handle_t *hsmbus)
{
  I2C_TypeDef *p_i2cx;

  ASSERT_DBG_PARAM((hsmbus != NULL));

  ASSERT_DBG_STATE(hsmbus->global_state, (uint32_t)HAL_SMBUS_STATE_IDLE);

  p_i2cx = I2C_GET_INSTANCE(hsmbus);

  LL_I2C_Disable(p_i2cx);
  LL_I2C_EnableWakeUpFromStop(p_i2cx);
  LL_I2C_Enable(p_i2cx);

  return HAL_OK;
}

/**
  * @brief  Disable Slave SMBUS wakeup from Stop mode(s).
  * @param  hsmbus Pointer to a @ref hal_smbus_handle_t
  * @retval HAL_OK Operation completed successfully
  */
hal_status_t HAL_SMBUS_SLAVE_DisableWakeUp(hal_smbus_handle_t *hsmbus)
{
  I2C_TypeDef *p_i2cx;

  ASSERT_DBG_PARAM((hsmbus != NULL));

  ASSERT_DBG_STATE(hsmbus->global_state, (uint32_t)HAL_SMBUS_STATE_IDLE);

  p_i2cx = I2C_GET_INSTANCE(hsmbus);

  LL_I2C_Disable(p_i2cx);
  LL_I2C_DisableWakeUpFromStop(p_i2cx);
  LL_I2C_Enable(p_i2cx);

  return HAL_OK;
}

/**
  * @brief  Check SMBUS slave wake up status.
  * @param  hsmbus Pointer to a @ref hal_smbus_handle_t
  * @retval HAL_SMBUS_SLAVE_WAKE_UP_ENABLED  Slave Wake Up is enabled
  * @retval HAL_SMBUS_SLAVE_WAKE_UP_DISABLED Slave Wake Up is disabled
  */
hal_smbus_slave_wake_up_status_t HAL_SMBUS_SLAVE_IsEnabledWakeUp(const hal_smbus_handle_t *hsmbus)
{
  I2C_TypeDef *p_i2cx;

  ASSERT_DBG_PARAM((hsmbus != NULL));

  ASSERT_DBG_STATE(hsmbus->global_state, (uint32_t)HAL_SMBUS_STATE_IDLE | (uint32_t)HAL_SMBUS_STATE_TX
                   | (uint32_t)HAL_SMBUS_STATE_RX | (uint32_t)HAL_SMBUS_STATE_LISTEN
                   | (uint32_t)HAL_SMBUS_STATE_RX_LISTEN | (uint32_t)HAL_SMBUS_STATE_TX_LISTEN
                   | (uint32_t)HAL_SMBUS_STATE_ABORT);

  p_i2cx = I2C_GET_INSTANCE(hsmbus);

  return (hal_smbus_slave_wake_up_status_t)LL_I2C_IsEnabledWakeUpFromStop(p_i2cx);
}

/**
  * @brief  Set hardware timeout configuration.
  * @param  hsmbus Pointer to a @ref hal_smbus_handle_t.
  * @param  p_config Pointer to hal_smbus_timeout_config_t containing both TimeoutA and B configuration.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_SMBUS_SetConfigTimeout(hal_smbus_handle_t *hsmbus, const hal_smbus_timeout_config_t *p_config)
{
  I2C_TypeDef *p_i2cx;

  ASSERT_DBG_PARAM((hsmbus != NULL));
  ASSERT_DBG_PARAM((p_config != NULL));
  ASSERT_DBG_PARAM(IS_SMBUS_TIMEOUT_VALUE(p_config->timeout_a));
  ASSERT_DBG_PARAM(IS_SMBUS_TIMEOUT_VALUE(p_config->timeout_b));
  ASSERT_DBG_PARAM(IS_SMBUS_TIMEOUT_MODE(p_config->timeout_a_mode));

  ASSERT_DBG_STATE(hsmbus->global_state, (uint32_t)HAL_SMBUS_STATE_IDLE);

  p_i2cx = I2C_GET_INSTANCE(hsmbus);

  LL_I2C_ConfigSMBusTimeout(p_i2cx, p_config->timeout_a, (uint32_t)p_config->timeout_a_mode, p_config->timeout_b);

  return HAL_OK;
}

/**
  * @brief  Get hardware timeout configuration.
  * @param  hsmbus Pointer to a @ref hal_smbus_handle_t.
  * @param  p_config Pointer to hal_smbus_timeout_config_t containing both TimeoutA and B configuration.
  */
void HAL_SMBUS_GetConfigTimeout(const hal_smbus_handle_t *hsmbus, hal_smbus_timeout_config_t *p_config)
{
  I2C_TypeDef *p_i2cx;
  uint32_t timeoutr_reg;

  ASSERT_DBG_PARAM((hsmbus != NULL));
  ASSERT_DBG_PARAM((p_config != NULL));

  ASSERT_DBG_STATE(hsmbus->global_state, (uint32_t)HAL_SMBUS_STATE_IDLE | (uint32_t)HAL_SMBUS_STATE_TX
                   | (uint32_t)HAL_SMBUS_STATE_RX | (uint32_t)HAL_SMBUS_STATE_LISTEN
                   | (uint32_t)HAL_SMBUS_STATE_RX_LISTEN | (uint32_t)HAL_SMBUS_STATE_TX_LISTEN
                   | (uint32_t)HAL_SMBUS_STATE_ABORT);

  p_i2cx = I2C_GET_INSTANCE(hsmbus);

  timeoutr_reg = LL_I2C_READ_REG(p_i2cx, TIMEOUTR);

  p_config->timeout_a = (timeoutr_reg & I2C_TIMEOUTR_TIMEOUTA) >> I2C_TIMEOUTR_TIMEOUTA_Pos;
  p_config->timeout_a_mode = (hal_smbus_timeout_a_mode_t)(timeoutr_reg & I2C_TIMEOUTR_TIDLE);
  p_config->timeout_b = (timeoutr_reg & I2C_TIMEOUTR_TIMEOUTB) >> I2C_TIMEOUTR_TIMEOUTB_Pos;
}

/**
  * @brief  Enable SMBUS timeout feature.
  * @param  hsmbus Pointer to a @ref hal_smbus_handle_t
  * @param  timeout Timeout to Enable
  * @retval HAL_OK Operation completed successfully
  */
hal_status_t HAL_SMBUS_EnableTimeout(hal_smbus_handle_t *hsmbus, const hal_smbus_timeout_t timeout)
{
  I2C_TypeDef *p_i2cx;

  ASSERT_DBG_PARAM((hsmbus != NULL));
  ASSERT_DBG_PARAM(IS_SMBUS_TIMEOUT(timeout));

  ASSERT_DBG_STATE(hsmbus->global_state, (uint32_t)HAL_SMBUS_STATE_IDLE);

  p_i2cx = I2C_GET_INSTANCE(hsmbus);

  LL_I2C_EnableSMBusTimeout(p_i2cx, (uint32_t)timeout);

  return HAL_OK;
}

/**
  * @brief  Disable SMBUS timeout feature.
  * @param  hsmbus Pointer to a @ref hal_smbus_handle_t
  * @param  timeout Timeout to disable
  * @retval HAL_OK Operation completed successfully
  */
hal_status_t HAL_SMBUS_DisableTimeout(hal_smbus_handle_t *hsmbus, const hal_smbus_timeout_t timeout)
{
  I2C_TypeDef *p_i2cx;

  ASSERT_DBG_PARAM((hsmbus != NULL));
  ASSERT_DBG_PARAM(IS_SMBUS_TIMEOUT(timeout));

  ASSERT_DBG_STATE(hsmbus->global_state, (uint32_t)HAL_SMBUS_STATE_IDLE);

  p_i2cx = I2C_GET_INSTANCE(hsmbus);

  LL_I2C_DisableSMBusTimeout(p_i2cx, (uint32_t)timeout);

  return HAL_OK;
}

/**
  * @brief  Get SMBUS Timeout A status.
  * @param  hsmbus Pointer to a @ref hal_smbus_handle_t
  * @retval HAL_SMBUS_TIMEOUT_NONE Timeout A is disabled
  * @retval HAL_SMBUS_SELECT_TIMEOUT_A Timeout A is enabled
  */
hal_smbus_timeout_t HAL_SMBUS_IsEnabledTimeoutA(const hal_smbus_handle_t *hsmbus)
{
  ASSERT_DBG_PARAM((hsmbus != NULL));

  ASSERT_DBG_STATE(hsmbus->global_state, (uint32_t)HAL_SMBUS_STATE_IDLE | (uint32_t)HAL_SMBUS_STATE_TX
                   | (uint32_t)HAL_SMBUS_STATE_RX | (uint32_t)HAL_SMBUS_STATE_LISTEN
                   | (uint32_t)HAL_SMBUS_STATE_RX_LISTEN | (uint32_t)HAL_SMBUS_STATE_TX_LISTEN
                   | (uint32_t)HAL_SMBUS_STATE_ABORT);

  I2C_TypeDef *p_i2cx = I2C_GET_INSTANCE(hsmbus);

  return (hal_smbus_timeout_t)((uint32_t)STM32_READ_BIT(p_i2cx->TIMEOUTR, I2C_TIMEOUTR_TIMOUTEN));
}

/**
  * @brief  Get SMBUS Timeout B status.
  * @param  hsmbus Pointer to a @ref hal_smbus_handle_t
  * @retval HAL_SMBUS_TIMEOUT_NONE Timeout B is disabled
  * @retval HAL_SMBUS_SELECT_TIMEOUT_A Timeout B is enabled
  */
hal_smbus_timeout_t HAL_SMBUS_IsEnabledTimeoutB(const hal_smbus_handle_t *hsmbus)
{
  ASSERT_DBG_PARAM((hsmbus != NULL));

