MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_smbus.c
  ASSERT_DBG_STATE(hsmbus->global_state, (uint32_t)HAL_SMBUS_STATE_IDLE | (uint32_t)HAL_SMBUS_STATE_TX
                   | (uint32_t)HAL_SMBUS_STATE_RX | (uint32_t)HAL_SMBUS_STATE_LISTEN
                   | (uint32_t)HAL_SMBUS_STATE_RX_LISTEN | (uint32_t)HAL_SMBUS_STATE_TX_LISTEN
                   | (uint32_t)HAL_SMBUS_STATE_ABORT);

  I2C_TypeDef *p_i2cx = I2C_GET_INSTANCE(hsmbus);

  return (hal_smbus_timeout_t)((uint32_t)STM32_READ_BIT(p_i2cx->TIMEOUTR, I2C_TIMEOUTR_TEXTEN));
}

/**
  * @brief  Enable SMBUS slave acknowledge general call address.
  * @param  hsmbus Pointer to a @ref hal_smbus_handle_t
  * @retval HAL_OK Operation completed successfully
  */
hal_status_t HAL_SMBUS_SLAVE_EnableAckGeneralCall(hal_smbus_handle_t *hsmbus)
{
  I2C_TypeDef *p_i2cx;

  ASSERT_DBG_PARAM((hsmbus != NULL));

  ASSERT_DBG_STATE(hsmbus->global_state, (uint32_t)HAL_SMBUS_STATE_IDLE);

  p_i2cx = I2C_GET_INSTANCE(hsmbus);

  LL_I2C_Disable(p_i2cx);
  LL_I2C_EnableGeneralCall(p_i2cx);
  LL_I2C_Enable(p_i2cx);

  return HAL_OK;
}

/**
  * @brief  Disable SMBUS slave acknowledge general call address.
  * @param  hsmbus Pointer to a @ref hal_smbus_handle_t
  * @retval HAL_OK Operation completed successfully
  */
hal_status_t HAL_SMBUS_SLAVE_DisableAckGeneralCall(hal_smbus_handle_t *hsmbus)
{
  I2C_TypeDef *p_i2cx;

  ASSERT_DBG_PARAM((hsmbus != NULL));

  ASSERT_DBG_STATE(hsmbus->global_state, (uint32_t)HAL_SMBUS_STATE_IDLE);

  p_i2cx = I2C_GET_INSTANCE(hsmbus);

  LL_I2C_Disable(p_i2cx);
  LL_I2C_DisableGeneralCall(p_i2cx);
  LL_I2C_Enable(p_i2cx);

  return HAL_OK;
}

/**
  * @brief  Check SMBUS slave acknowledge general call status.
  * @param  hsmbus Pointer to a @ref hal_smbus_handle_t
  * @retval HAL_SMBUS_SLAVE_ACK_GENERAL_CALL_ENABLED    Slave Acknowledge General Call is enabled
  * @retval HAL_SMBUS_SLAVE_ACK_GENERAL_CALL_DISABLED   Slave Acknowledge General Call is disabled
  */
hal_smbus_slave_ack_general_call_status_t HAL_SMBUS_SLAVE_IsEnabledAckGeneralCall(const hal_smbus_handle_t *hsmbus)
{
  I2C_TypeDef *p_i2cx;

  ASSERT_DBG_PARAM((hsmbus != NULL));

  ASSERT_DBG_STATE(hsmbus->global_state, (uint32_t)HAL_SMBUS_STATE_IDLE | (uint32_t)HAL_SMBUS_STATE_TX
                   | (uint32_t)HAL_SMBUS_STATE_RX | (uint32_t)HAL_SMBUS_STATE_LISTEN
                   | (uint32_t)HAL_SMBUS_STATE_RX_LISTEN | (uint32_t)HAL_SMBUS_STATE_TX_LISTEN
                   | (uint32_t)HAL_SMBUS_STATE_ABORT);

  p_i2cx = I2C_GET_INSTANCE(hsmbus);

  return (hal_smbus_slave_ack_general_call_status_t)LL_I2C_IsEnabledGeneralCall(p_i2cx);
}

/**
  * @brief  Enable Packet Error Check.
  * @param  hsmbus Pointer to a @ref hal_smbus_handle_t
  * @retval HAL_OK Operation completed successfully
  */
hal_status_t HAL_SMBUS_EnablePacketErrorCheck(hal_smbus_handle_t *hsmbus)
{
  I2C_TypeDef *p_i2cx;

  ASSERT_DBG_PARAM((hsmbus != NULL));

  ASSERT_DBG_STATE(hsmbus->global_state, (uint32_t)HAL_SMBUS_STATE_IDLE);

  p_i2cx = I2C_GET_INSTANCE(hsmbus);

  LL_I2C_EnableSMBusPEC(p_i2cx);

  return HAL_OK;
}

/**
  * @brief  Disable Packet Error Check.
  * @param  hsmbus Pointer to a @ref hal_smbus_handle_t
  * @retval HAL_OK Operation completed successfully
  */
hal_status_t HAL_SMBUS_DisablePacketErrorCheck(hal_smbus_handle_t *hsmbus)
{
  I2C_TypeDef *p_i2cx;

  ASSERT_DBG_PARAM((hsmbus != NULL));

  ASSERT_DBG_STATE(hsmbus->global_state, (uint32_t)HAL_SMBUS_STATE_IDLE);

  p_i2cx = I2C_GET_INSTANCE(hsmbus);

  LL_I2C_DisableSMBusPEC(p_i2cx);

  return HAL_OK;
}

/**
  * @brief  Check SMBUS packet error check(PEC) status.
  * @param  hsmbus Pointer to a @ref hal_smbus_handle_t
  * @retval HAL_SMBUS_PEC_ENABLED     Packet Error Check enabled
  * @retval HAL_SMBUS_PEC_DISABLED    Packet Error Check disabled
  */
hal_smbus_pec_status_t HAL_SMBUS_IsEnabledPacketErrorCheck(const hal_smbus_handle_t *hsmbus)
{
  I2C_TypeDef *p_i2cx;

  ASSERT_DBG_PARAM((hsmbus != NULL));

  ASSERT_DBG_STATE(hsmbus->global_state, (uint32_t)HAL_SMBUS_STATE_IDLE | (uint32_t)HAL_SMBUS_STATE_TX
                   | (uint32_t)HAL_SMBUS_STATE_RX | (uint32_t)HAL_SMBUS_STATE_LISTEN
                   | (uint32_t)HAL_SMBUS_STATE_RX_LISTEN | (uint32_t)HAL_SMBUS_STATE_TX_LISTEN
                   | (uint32_t)HAL_SMBUS_STATE_ABORT);

  p_i2cx = I2C_GET_INSTANCE(hsmbus);

  return (hal_smbus_pec_status_t) LL_I2C_IsEnabledSMBusPEC(p_i2cx);
}

/**
  * @brief  Enable Alert Interruption.
  * @param  hsmbus Pointer to a @ref hal_smbus_handle_t
  * @retval HAL_OK Operation completed successfully
  */
hal_status_t HAL_SMBUS_MASTER_EnableAlertIT(hal_smbus_handle_t *hsmbus)
{
  I2C_TypeDef *p_i2cx;

  ASSERT_DBG_PARAM((hsmbus != NULL));

  ASSERT_DBG_STATE(hsmbus->global_state, (uint32_t)HAL_SMBUS_STATE_IDLE);

  p_i2cx = I2C_GET_INSTANCE(hsmbus);

  LL_I2C_EnableSMBusAlert(p_i2cx);
  LL_I2C_ClearSMBusFlag_ALERT(p_i2cx);

  /* Enable Alert Interrupt */
  SMBUS_Enable_IRQ(hsmbus, SMBUS_ALERT_IT_MASK);

  return HAL_OK;
}

/**
  * @brief  Disable Alert Interruption.
  * @param  hsmbus Pointer to a @ref hal_smbus_handle_t
  * @retval HAL_OK Operation completed successfully
  */
hal_status_t HAL_SMBUS_MASTER_DisableAlertIT(hal_smbus_handle_t *hsmbus)
{
  I2C_TypeDef *p_i2cx;

  ASSERT_DBG_PARAM((hsmbus != NULL));

  ASSERT_DBG_STATE(hsmbus->global_state, (uint32_t)HAL_SMBUS_STATE_IDLE);

  /* Disable Alert Interrupt */
  SMBUS_Disable_IRQ(hsmbus, SMBUS_ALERT_IT_MASK);

  p_i2cx = I2C_GET_INSTANCE(hsmbus);

  /* Disable SMBus alert */
  LL_I2C_DisableSMBusAlert(p_i2cx);

  return HAL_OK;
}

/**
  * @brief  Check SMBUS Alert interruption status.
  * @param  hsmbus Pointer to a @ref hal_smbus_handle_t
  * @retval HAL_SMBUS_ALERT_ENABLED      Alert interruption enabled
  * @retval HAL_SMBUS_ALERT_DISABLED     Alert interruption disabled
  */
hal_smbus_alert_status_t HAL_SMBUS_MASTER_IsEnabledAlertIT(const hal_smbus_handle_t *hsmbus)
{
  I2C_TypeDef *p_i2cx;

  ASSERT_DBG_PARAM((hsmbus != NULL));

  ASSERT_DBG_STATE(hsmbus->global_state, (uint32_t)HAL_SMBUS_STATE_IDLE | (uint32_t)HAL_SMBUS_STATE_TX
                   | (uint32_t)HAL_SMBUS_STATE_RX | (uint32_t)HAL_SMBUS_STATE_LISTEN
                   | (uint32_t)HAL_SMBUS_STATE_RX_LISTEN | (uint32_t)HAL_SMBUS_STATE_TX_LISTEN
                   | (uint32_t)HAL_SMBUS_STATE_ABORT);

