MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_smbus.c
  p_i2cx = I2C_GET_INSTANCE(hsmbus);

  return (hal_smbus_alert_status_t) LL_I2C_IsEnabledSMBusAlert(p_i2cx);
}

/**
  * @brief  Set the SMBUS own address2 configuration.
  * @param  hsmbus Pointer to a @ref hal_smbus_handle_t.
  * @param  addr  The second device own address. It is a 7-bit address but the value must be shifted left by 1 bit.
  *               In other words, an 8-bit value is required and the bit 0 is not considered.
  * @param  mask  Acknowledge mask address second device own address.
  * @retval HAL_OK Operation completed successfully
  */
hal_status_t HAL_SMBUS_SetConfigOwnAddress2(hal_smbus_handle_t *hsmbus, uint32_t addr, hal_smbus_own_addr2_mask_t mask)
{
  I2C_TypeDef *p_i2cx;

  ASSERT_DBG_PARAM((hsmbus != NULL));
  ASSERT_DBG_PARAM(IS_SMBUS_ADDRESS(addr));
  ASSERT_DBG_PARAM(IS_SMBUS_OWN_ADDRESS2_MASK(mask));

  ASSERT_DBG_STATE(hsmbus->global_state, (uint32_t)HAL_SMBUS_STATE_IDLE);

  p_i2cx = I2C_GET_INSTANCE(hsmbus);

  LL_I2C_Disable(p_i2cx);
  LL_I2C_SetOwnAddress2(p_i2cx, addr, (uint32_t)mask);
  LL_I2C_Enable(p_i2cx);

  return HAL_OK;
}

/**
  * @brief  Get the SMBUS own address2 configuration.
  * @param  hsmbus Pointer to a @ref hal_smbus_handle_t.
  * @param  p_addr The second device own address. It is a 7-bit address but the value is shifted left by 1 bit.
  *                In other words, an 8-bit value is returned and the bit 0 is not considered.
  * @param  p_mask Acknowledge mask address second device own address.
  */
void HAL_SMBUS_GetConfigOwnAddress2(const hal_smbus_handle_t *hsmbus, uint32_t *p_addr,
                                    hal_smbus_own_addr2_mask_t *p_mask)
{
  I2C_TypeDef *p_i2cx;

  ASSERT_DBG_PARAM((hsmbus != NULL));
  ASSERT_DBG_PARAM((p_addr != NULL));
  ASSERT_DBG_PARAM((p_mask != NULL));

  ASSERT_DBG_STATE(hsmbus->global_state, (uint32_t)HAL_SMBUS_STATE_IDLE | (uint32_t)HAL_SMBUS_STATE_TX
                   | (uint32_t)HAL_SMBUS_STATE_RX | (uint32_t)HAL_SMBUS_STATE_LISTEN
                   | (uint32_t)HAL_SMBUS_STATE_RX_LISTEN | (uint32_t)HAL_SMBUS_STATE_TX_LISTEN
                   | (uint32_t)HAL_SMBUS_STATE_ABORT);

  p_i2cx = I2C_GET_INSTANCE(hsmbus);

  *p_addr = LL_I2C_GetOwnAddress2(p_i2cx);
  *p_mask = (hal_smbus_own_addr2_mask_t)LL_I2C_GetOwnAddress2Mask(p_i2cx);
}

/**
  * @brief  Enable SMBUS Own Address2.
  * @param  hsmbus Pointer to a @ref hal_smbus_handle_t
  * @retval HAL_OK Operation completed successfully
  */
hal_status_t HAL_SMBUS_EnableOwnAddress2(hal_smbus_handle_t *hsmbus)
{
  I2C_TypeDef *p_i2cx;

  ASSERT_DBG_PARAM((hsmbus != NULL));

  ASSERT_DBG_STATE(hsmbus->global_state, (uint32_t)HAL_SMBUS_STATE_IDLE);

  p_i2cx = I2C_GET_INSTANCE(hsmbus);

  LL_I2C_Disable(p_i2cx);
  LL_I2C_EnableOwnAddress2(p_i2cx);
  LL_I2C_Enable(p_i2cx);

  return HAL_OK;
}

/**
  * @brief  Disable SMBUS Own Address2.
  * @param  hsmbus Pointer to a @ref hal_smbus_handle_t
  * @retval HAL_OK Operation completed successfully
  */
hal_status_t HAL_SMBUS_DisableOwnAddress2(hal_smbus_handle_t *hsmbus)
{
  I2C_TypeDef *p_i2cx;

  ASSERT_DBG_PARAM((hsmbus != NULL));

  ASSERT_DBG_STATE(hsmbus->global_state, (uint32_t)HAL_SMBUS_STATE_IDLE);

  p_i2cx = I2C_GET_INSTANCE(hsmbus);

  LL_I2C_Disable(p_i2cx);
  LL_I2C_DisableOwnAddress2(p_i2cx);
  LL_I2C_Enable(p_i2cx);

  return HAL_OK;
}

/**
  * @brief  Check SMBUS own address 2 status.
  * @param  hsmbus Pointer to a @ref hal_smbus_handle_t
  * @retval HAL_SMBUS_OWN_ADDR2_ENABLED   Dual addressing is enabled
  * @retval HAL_SMBUS_OWN_ADDR2_DISABLED  Dual addressing is disabled
  */
hal_smbus_own_addr2_status_t HAL_SMBUS_IsEnabledOwnAddress2(const hal_smbus_handle_t *hsmbus)
{
  I2C_TypeDef *p_i2cx;

  ASSERT_DBG_PARAM((hsmbus != NULL));

  ASSERT_DBG_STATE(hsmbus->global_state, (uint32_t)HAL_SMBUS_STATE_IDLE | (uint32_t)HAL_SMBUS_STATE_TX
                   | (uint32_t)HAL_SMBUS_STATE_RX | (uint32_t)HAL_SMBUS_STATE_LISTEN
                   | (uint32_t)HAL_SMBUS_STATE_RX_LISTEN | (uint32_t)HAL_SMBUS_STATE_TX_LISTEN
                   | (uint32_t)HAL_SMBUS_STATE_ABORT);

  p_i2cx = I2C_GET_INSTANCE(hsmbus);

  return (hal_smbus_own_addr2_status_t)LL_I2C_IsEnabledOwnAddress2(p_i2cx);
}

/**
  * @brief  Set the functional SMBUS mode(Host, Slave or Slave ARP).
  * @param  hsmbus Pointer to a @ref hal_smbus_handle_t
  * @param  mode   Mode to set from hal_smbus_mode_t
  * @retval HAL_OK Operation completed successfully
  */
hal_status_t HAL_SMBUS_SetMode(hal_smbus_handle_t *hsmbus, const hal_smbus_mode_t mode)
{
  I2C_TypeDef *p_i2cx;

  ASSERT_DBG_PARAM((hsmbus != NULL));
  ASSERT_DBG_PARAM(IS_SMBUS_MODE(mode));

  ASSERT_DBG_STATE(hsmbus->global_state, HAL_SMBUS_STATE_IDLE);

  p_i2cx = I2C_GET_INSTANCE(hsmbus);

  LL_I2C_SetMode(p_i2cx, (uint32_t)mode);

  return HAL_OK;
}

/**
  * @brief  Return the functional SMBUS mode. Host, Slave or Slave ARP.
  * @param  hsmbus Pointer to a @ref hal_smbus_handle_t
  * @retval HAL mode
  */
hal_smbus_mode_t HAL_SMBUS_GetMode(const hal_smbus_handle_t *hsmbus)
{
  I2C_TypeDef *p_i2cx;

  ASSERT_DBG_PARAM((hsmbus != NULL));

  ASSERT_DBG_STATE(hsmbus->global_state, (uint32_t)HAL_SMBUS_STATE_IDLE | (uint32_t)HAL_SMBUS_STATE_TX
                   | (uint32_t)HAL_SMBUS_STATE_RX | (uint32_t)HAL_SMBUS_STATE_LISTEN
                   | (uint32_t)HAL_SMBUS_STATE_RX_LISTEN | (uint32_t)HAL_SMBUS_STATE_TX_LISTEN
                   | (uint32_t)HAL_SMBUS_STATE_ABORT);

  p_i2cx = I2C_GET_INSTANCE(hsmbus);

  return (hal_smbus_mode_t)LL_I2C_GetMode(p_i2cx);
}

/**
  * @brief  Enable the SMBUS fast mode plus driving capability.
  * @param  hsmbus Pointer to a @ref hal_smbus_handle_t
  * @retval HAL_OK Operation completed successfully
  */
hal_status_t HAL_SMBUS_EnableFastModePlus(hal_smbus_handle_t *hsmbus)
{
  I2C_TypeDef *p_i2cx;

  /* Check the parameter */
  ASSERT_DBG_PARAM((hsmbus != NULL));

  ASSERT_DBG_STATE(hsmbus->global_state, (uint32_t)HAL_SMBUS_STATE_IDLE);

  p_i2cx = I2C_GET_INSTANCE(hsmbus);

  LL_I2C_Disable(p_i2cx);
  LL_I2C_EnableFastModePlus(p_i2cx);
  LL_I2C_Enable(p_i2cx);

  return HAL_OK;
}

/**
  * @brief  Disable the SMBUS fast mode plus driving capability.
  * @param  hsmbus Pointer to a @ref hal_smbus_handle_t.
  * @retval HAL_OK Operation completed successfully
  */
hal_status_t HAL_SMBUS_DisableFastModePlus(hal_smbus_handle_t *hsmbus)
{
  I2C_TypeDef *p_i2cx;

  /* Check the parameter */
  ASSERT_DBG_PARAM((hsmbus != NULL));

  ASSERT_DBG_STATE(hsmbus->global_state, (uint32_t)HAL_SMBUS_STATE_IDLE);

