MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_smbus.c
  hsmbus->p_slave_addr_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register the SMBUS Error callback.
  * @param  hsmbus Pointer to a @ref hal_smbus_handle_t
  * @param  p_callback Pointer to the SMBUS Error callback function
  * @retval HAL_OK Operation completed successfully
  * @retval HAL_INVALID_PARAM Invalid parameter
  */
hal_status_t HAL_SMBUS_RegisterErrorCallback(hal_smbus_handle_t *hsmbus, hal_smbus_cb_t p_callback)
{
  ASSERT_DBG_PARAM((hsmbus != NULL));
  ASSERT_DBG_PARAM((p_callback != NULL));

  ASSERT_DBG_STATE(hsmbus->global_state, (uint32_t)HAL_SMBUS_STATE_INIT | (uint32_t)HAL_SMBUS_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hsmbus->p_error_cb = p_callback;

  return HAL_OK;
}
#endif /* USE_HAL_SMBUS_REGISTER_CALLBACKS */

/**
  * @}
  */

/** @addtogroup SMBUS_Exported_Functions_Group3
  * @{
A set of functions to manage the SMBUS data transfers.

- There are two modes of transfer:
  - Blocking mode: The communication is performed in polling mode.
    The status of all data processing is returned by the same function after finishing transfer.
  - Non-blocking mode: The communication is performed using interrupts because DMA is not supported due to SMBUS need
    to perform exchange with a byte granularity within the slave device.
    These functions return the status of the transfer startup.
    The end of the data processing will be indicated through the dedicated SMBUS IRQ when using interrupt mode.

- Blocking mode functions are:
  - HAL_SMBUS_MASTER_PollForSlaveReady()

- Non-Blocking mode functions with Interrupt are :
  - HAL_SMBUS_MASTER_SEQ_Transmit_IT()
  - HAL_SMBUS_MASTER_SEQ_Receive_IT()
  - HAL_SMBUS_SLAVE_SEQ_Transmit_IT()
  - HAL_SMBUS_SLAVE_SEQ_Receive_IT()
  - HAL_SMBUS_SLAVE_EnableListen_IT()
  - HAL_SMBUS_SLAVE_DisableListen_IT()
  - HAL_SMBUS_MASTER_Abort_IT()
  - HAL_SMBUS_SLAVE_Abort_IT()

- A set of Transfer weak complete callbacks are provided in non-blocking mode:
  - HAL_SMBUS_MASTER_TxCpltCallback()
  - HAL_SMBUS_MASTER_RxCpltCallback()
  - HAL_SMBUS_SLAVE_TxCpltCallback()
  - HAL_SMBUS_SLAVE_RxCpltCallback()
  - HAL_SMBUS_SLAVE_AddrCallback()
  - HAL_SMBUS_SLAVE_ListenCpltCallback()
  - HAL_SMBUS_ErrorCallback()
  - HAL_SMBUS_AbortCpltCallback()
  */

/**
  * @brief  Check if slave device is ready for communication.
  * @param  hsmbus Pointer to a @ref hal_smbus_handle_t
  * @param  device_addr Target device address: The device 7 bits address value
  *         in datasheet must be shifted to the left before calling the interface
  * @param  timeout_ms Timeout duration in millisecond
  * @retval HAL_OK            Target is ready for communication
  * @retval HAL_ERROR         Internal failure while waiting for hardware flags
  * @retval HAL_INVALID_PARAM Invalid parameter
  * @retval HAL_TIMEOUT       User timeout elapsed: device not ready in time
  */
hal_status_t HAL_SMBUS_MASTER_PollForSlaveReady(hal_smbus_handle_t *hsmbus, uint32_t device_addr, uint32_t timeout_ms)
{
  I2C_TypeDef *p_i2cx;
  hal_status_t hal_status = HAL_OK;
  uint32_t tick_start;
  uint32_t tmp1;
  uint32_t tmp2;

  ASSERT_DBG_PARAM((hsmbus != NULL));
  ASSERT_DBG_PARAM(IS_SMBUS_ADDRESS(device_addr));

  ASSERT_DBG_STATE(hsmbus->global_state, HAL_SMBUS_STATE_IDLE);

  HAL_CHECK_UPDATE_STATE(hsmbus, global_state, HAL_SMBUS_STATE_IDLE, HAL_SMBUS_STATE_TX);

  p_i2cx = I2C_GET_INSTANCE(hsmbus);

  while (hal_status == HAL_OK)
  {
    tick_start = HAL_GetTick();

    while (LL_I2C_IsActiveFlag_BUSY(p_i2cx) != 0U)
    {
      if (((HAL_GetTick() - tick_start) > timeout_ms) || (timeout_ms == 0U))
      {
        hsmbus->global_state = HAL_SMBUS_STATE_IDLE;
        return HAL_TIMEOUT;
      }
    }

    /* Generate Start */
    LL_I2C_WRITE_REG(p_i2cx, CR2, (uint32_t)((((uint32_t)(device_addr) & (I2C_CR2_SADD))
                                              | (I2C_CR2_START) | (I2C_CR2_AUTOEND)) & (~I2C_CR2_RD_WRN)));

    /* No need to Check TC flag, with AUTOEND mode the stop is automatically generated */
    /* Wait until STOPF flag is set and a NACK flag is set*/
    tmp1 = LL_I2C_IsActiveFlag_STOP(p_i2cx);
    tmp2 = LL_I2C_IsActiveFlag_NACK(p_i2cx);

    while (((tmp1 == 0U) && (tmp2 == 0U)) && (hal_status == HAL_OK))
    {
      if (timeout_ms != HAL_MAX_DELAY)
      {
        if (((HAL_GetTick() - tick_start) > timeout_ms) || (timeout_ms == 0U))
        {
          hsmbus->global_state = HAL_SMBUS_STATE_IDLE;
          hal_status = HAL_TIMEOUT;
        }
      }

      tmp1 = LL_I2C_IsActiveFlag_STOP(p_i2cx);
      tmp2 = LL_I2C_IsActiveFlag_NACK(p_i2cx);
    }

    if (hal_status == HAL_OK)
    {
      if (LL_I2C_IsActiveFlag_NACK(p_i2cx) == 0U)
      {
        /* Wait until STOPF flag is reset */
        if (SMBUS_WaitOnFlagUntilTimeout(hsmbus, LL_I2C_ISR_STOPF, 0U, timeout_ms, tick_start) == HAL_OK)
        {
          /* An acknowledge appear during STOP Flag waiting process, this mean that device respond to its address */
          LL_I2C_ClearFlag_STOP(p_i2cx);
          break;
        }
        else
        {
          /* A non acknowledge appear during STOP Flag waiting process, a new trial must be performed */
          /* Clear STOP Flag */
          LL_I2C_ClearFlag_STOP(p_i2cx);

          hal_status = HAL_ERROR;
        }
      }
      else
      {
        /* A non acknowledge is detected, this mean that device not respond to its address,
          a new trial must be performed */

        LL_I2C_ClearFlag_NACK(p_i2cx);

        /* Wait until STOPF flag is reset */
        if (SMBUS_WaitOnFlagUntilTimeout(hsmbus, LL_I2C_ISR_STOPF, 0U, SMBUS_DEFAULT_TIMEOUT_MS, tick_start) == HAL_OK)
        {
          /* Clear STOP flag, auto generated with autoend */
          LL_I2C_ClearFlag_STOP(p_i2cx);
        }

        hal_status = HAL_ERROR;
      }
    }
  }

  hsmbus->global_state = HAL_SMBUS_STATE_IDLE;

  return hal_status;
}

/**
  * @brief  Sequential transmit in master SMBUS mode an amount of data in non-blocking mode with Interrupt.
  * @param  hsmbus Pointer to a @ref hal_smbus_handle_t
  * @param  device_addr Target device address: The device 7 bits address value
  *         in datasheet must be shifted to the left before calling the interface
  * @param  p_data Pointer to data buffer
  * @param  size_byte Amount of data to send in bytes
  * @param  xfer_opt Options of Transfer
  * @note   This interface allows to manage repeated start condition when a direction change during transfer
  * @retval HAL_OK            Operation started successfully
  * @retval HAL_BUSY          Concurrent process ongoing
  * @retval HAL_INVALID_PARAM Invalid parameter
  * @retval HAL_ERROR         Operation completed with error
  */
hal_status_t HAL_SMBUS_MASTER_SEQ_Transmit_IT(hal_smbus_handle_t *hsmbus, uint32_t device_addr, const void *p_data,
                                              uint32_t size_byte, hal_smbus_xfer_opt_t xfer_opt)
{
  I2C_TypeDef *p_i2cx;

  hal_smbus_xfer_opt_t tmp;
  smbus_start_stop_mode_t request;

  ASSERT_DBG_PARAM((hsmbus != NULL));
  /* Allowed parameters, if size_byte is equals to 0 and p_data is equals to NULL */
  ASSERT_DBG_PARAM((p_data != NULL) || (size_byte == 0U));
  ASSERT_DBG_PARAM(IS_SMBUS_ADDRESS(device_addr));
  ASSERT_DBG_PARAM(IS_SMBUS_TRANSFER_OPTIONS_REQUEST(xfer_opt));

  ASSERT_DBG_STATE(hsmbus->global_state, HAL_SMBUS_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_data == NULL) && (size_byte != 0U)) /* p_data can be NULL if size_byte = 0 */
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

