MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_smbus.c
  p_i2cx = I2C_GET_INSTANCE(hsmbus);

  HAL_CHECK_UPDATE_STATE(hsmbus, global_state, HAL_SMBUS_STATE_IDLE, HAL_SMBUS_STATE_TX);

  /* Prepare transfer parameters */
  hsmbus->p_buf_tx = (const uint8_t *)p_data;
  hsmbus->xfer_count = size_byte;
  hsmbus->xfer_opt = xfer_opt;
  hsmbus->xfer_isr = SMBUS_Master_ISR;
  hsmbus->last_error_codes = HAL_SMBUS_ERROR_NONE;

  /* In case of Quick command, remove autoend mode */
  /* Manage the stop generation by software */
  if (hsmbus->p_buf_tx == NULL)
  {
    hsmbus->xfer_opt = HAL_SMBUS_XFER_FIRST_FRAME;
  }

  if (size_byte > MAX_NBYTE_SIZE)
  {
    hsmbus->xfer_size = MAX_NBYTE_SIZE;
  }
  else
  {
    hsmbus->xfer_size = size_byte;
  }

  /* Send Slave Address */
  /* Set NBYTES to write and reload if size > MAX_NBYTE_SIZE and generate RESTART */
  if ((hsmbus->xfer_size < hsmbus->xfer_count) && (hsmbus->xfer_size == MAX_NBYTE_SIZE))
  {
    SMBUS_TransferConfig(p_i2cx, device_addr, hsmbus->xfer_size,
                         SMBUS_RELOAD_MODE | ((uint32_t)hsmbus->xfer_opt & SMBUS_SENDPEC_MODE),
                         SMBUS_GENERATE_START_WRITE);
  }
  else
  {
    /* If transfer direction not changed, do not generate Restart Condition */
    /* Mean Previous state is same as current state */

    /* Store current volatile xfer_opt, misra rule */
    tmp = hsmbus->xfer_opt;

    if ((hsmbus->previous_state == (uint32_t)HAL_SMBUS_STATE_TX) && (IS_SMBUS_TRANSFER_OTHER_OPTIONS_REQUEST(tmp) == 0))
    {
      request = SMBUS_NO_STARTSTOP;
    }
    /* Else transfer direction change, so generate Restart with new transfer direction */
    else
    {
      /* Convert OTHER_xxx xfer_opt if any */
      SMBUS_ConvertOtherXferOptions(hsmbus);

      /* Handle Transfer */
      request = SMBUS_GENERATE_START_WRITE;
    }

    SMBUS_TransferConfig(p_i2cx, device_addr, hsmbus->xfer_size, (uint32_t)hsmbus->xfer_opt, request);

    /* If PEC mode is enabled, size to transmit managed by SW part must be Size-1 byte, corresponding to PEC byte */
    /* PEC byte is automatically sent by HW block, no need to manage it in Transmit process */
    if (LL_I2C_IsEnabledSMBusPECCompare(p_i2cx) != 0U)
    {
      if (hsmbus->xfer_size > 0U)
      {
        hsmbus->xfer_size--;
        hsmbus->xfer_count--;
      }
      else
      {
        hsmbus->global_state = HAL_SMBUS_STATE_IDLE;
        return HAL_ERROR;
      }
    }
  }

  SMBUS_Enable_IRQ(hsmbus, SMBUS_TX_IT_MASK);
  return HAL_OK;
}

/**
  * @brief  Sequential receive in master SMBUS mode an amount of data in non-blocking mode with Interrupt.
  * @param  hsmbus Pointer to a @ref hal_smbus_handle_t
  * @param  device_addr Target device address: The device 7 bits address value
  *         in datasheet must be shifted to the left before calling the interface
  * @param  p_data Pointer to data buffer
  * @param  size_byte Amount of data to receive in bytes
  * @param  xfer_opt Options of Transfer
  * @note   This interface allows to manage repeated start condition when a direction change during transfer
  * @retval HAL_OK            Operation started successfully
  * @retval HAL_BUSY          Concurrent process ongoing
  * @retval HAL_INVALID_PARAM Invalid parameter
  */
hal_status_t HAL_SMBUS_MASTER_SEQ_Receive_IT(hal_smbus_handle_t *hsmbus, uint32_t device_addr, void *p_data,
                                             uint32_t size_byte, hal_smbus_xfer_opt_t xfer_opt)
{
  I2C_TypeDef *p_i2cx;
  smbus_start_stop_mode_t request;
  hal_smbus_xfer_opt_t tmp;

  ASSERT_DBG_PARAM((hsmbus != NULL));
  /* Allowed parameters, if size_byte is equals to 0 and p_data is equals to NULL */
  ASSERT_DBG_PARAM((p_data != NULL) || (size_byte == 0U));
  ASSERT_DBG_PARAM(IS_SMBUS_ADDRESS(device_addr));
  ASSERT_DBG_PARAM(IS_SMBUS_TRANSFER_OPTIONS_REQUEST(xfer_opt));

  ASSERT_DBG_STATE(hsmbus->global_state, HAL_SMBUS_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_data == NULL) && (size_byte != 0U)) /* p_data can be NULL if size_byte = 0 */
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  HAL_CHECK_UPDATE_STATE(hsmbus, global_state, HAL_SMBUS_STATE_IDLE, HAL_SMBUS_STATE_RX);

  p_i2cx = I2C_GET_INSTANCE(hsmbus);

  /* Prepare transfer parameters */
  hsmbus->p_buf_rx = (uint8_t *)p_data;
  hsmbus->xfer_count = size_byte;
  hsmbus->xfer_opt = xfer_opt;
  hsmbus->xfer_isr = SMBUS_Master_ISR;
  hsmbus->last_error_codes = HAL_SMBUS_ERROR_NONE;

  /* In case of Quick command, remove autoend mode */
  /* Manage the stop generation by software */
  if (hsmbus->p_buf_rx == NULL)
  {
    hsmbus->xfer_opt = HAL_SMBUS_XFER_FIRST_FRAME;
  }

  if (size_byte > MAX_NBYTE_SIZE)
  {
    hsmbus->xfer_size = MAX_NBYTE_SIZE;
  }
  else
  {
    hsmbus->xfer_size = size_byte;
  }

  /* Send Slave Address */
  /* Set NBYTES to write and reload if size > MAX_NBYTE_SIZE and generate RESTART */
  if ((hsmbus->xfer_size < hsmbus->xfer_count) && (hsmbus->xfer_size == MAX_NBYTE_SIZE))
  {
    request = SMBUS_GENERATE_START_READ;
    SMBUS_TransferConfig(p_i2cx, device_addr, hsmbus->xfer_size,
                         (SMBUS_RELOAD_MODE | ((uint32_t)hsmbus->xfer_opt & SMBUS_SENDPEC_MODE)), request);
  }
  else
  {
    /* If transfer direction not changed, do not generate Restart Condition */
    /* Mean Previous state is same as current state */

    /* Store current volatile XferOptions, Misra rule */
    tmp = hsmbus->xfer_opt;

    if ((hsmbus->previous_state == (uint32_t)HAL_SMBUS_STATE_RX)
        && (IS_SMBUS_TRANSFER_OTHER_OPTIONS_REQUEST(tmp) == 0U))
    {
      request = SMBUS_NO_STARTSTOP;
    }
    /* Else transfer direction change, so generate Restart with new transfer direction */
    else
    {
      /* Convert OTHER_xxx XferOptions if any */
      SMBUS_ConvertOtherXferOptions(hsmbus);

      /* Handle Transfer */
      request = SMBUS_GENERATE_START_READ;
    }
    SMBUS_TransferConfig(p_i2cx, device_addr, hsmbus->xfer_size,
                         (uint32_t)hsmbus->xfer_opt,
                         request);
  }

