MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_smbus.c
  SMBUS_Enable_IRQ(hsmbus, SMBUS_RX_IT_MASK);

  return HAL_OK;
}

/**
  * @brief  Sequential transmit in slave/device SMBUS mode an amount of data in non-blocking mode with Interrupt.
  * @param  hsmbus Pointer to a @ref hal_smbus_handle_t
  * @param  p_data Pointer to data buffer
  * @param  size_byte Amount of data to send in bytes
  * @param  xfer_opt Options of Transfer
  * @note   This interface allows to manage repeated start condition when a direction change during transfer
  * @retval HAL_OK            Operation started successfully
  * @retval HAL_BUSY          Concurrent process ongoing
  * @retval HAL_INVALID_PARAM Invalid parameter
  */
hal_status_t HAL_SMBUS_SLAVE_SEQ_Transmit_IT(hal_smbus_handle_t *hsmbus, const void *p_data, uint32_t size_byte,
                                             hal_smbus_xfer_opt_t xfer_opt)
{
  I2C_TypeDef *p_i2cx;

  ASSERT_DBG_PARAM((hsmbus != NULL));
  /* Allowed parameters, if size_byte is equals to 0 and p_data is equals to NULL */
  ASSERT_DBG_PARAM((p_data != NULL) || (size_byte == 0U));
  ASSERT_DBG_PARAM(IS_SMBUS_TRANSFER_OPTIONS_REQUEST(xfer_opt));

  ASSERT_DBG_STATE(hsmbus->global_state, (uint32_t)HAL_SMBUS_STATE_LISTEN | (uint32_t)HAL_SMBUS_STATE_RX_LISTEN
                   | (uint32_t)HAL_SMBUS_STATE_TX_LISTEN);

  p_i2cx = I2C_GET_INSTANCE(hsmbus);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_data == NULL) && (size_byte != 0U)) /* p_data can be NULL if size_byte = 0 */
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  HAL_CHECK_UPDATE_STATE(hsmbus, global_state, HAL_SMBUS_STATE_LISTEN, HAL_SMBUS_STATE_TX_LISTEN);

  /* Disable Interrupts, to prevent preemption during treatment in case of multicall */
  SMBUS_Disable_IRQ(hsmbus, SMBUS_ADDR_IT_MASK | SMBUS_TX_IT_MASK);

  /* Set SBC bit in CR1 to manage Acknowledge at each bit */
  LL_I2C_EnableSlaveByteControl(p_i2cx);

  LL_I2C_AcknowledgeEnable(p_i2cx);

  /* Prepare transfer parameters */
  hsmbus->p_buf_tx = (const uint8_t *)p_data;
  hsmbus->xfer_count = size_byte;
  hsmbus->xfer_opt = xfer_opt;
  hsmbus->xfer_isr = SMBUS_Slave_ISR;
  hsmbus->last_error_codes = HAL_SMBUS_ERROR_NONE;

  SMBUS_ConvertOtherXferOptions(hsmbus);

  if (size_byte > MAX_NBYTE_SIZE)
  {
    hsmbus->xfer_size = MAX_NBYTE_SIZE;
  }
  else
  {
    hsmbus->xfer_size = size_byte;
  }

  /* Set NBYTES to write and reload if size > MAX_NBYTE_SIZE and generate RESTART */
  if ((hsmbus->xfer_size < hsmbus->xfer_count) && (hsmbus->xfer_size == MAX_NBYTE_SIZE))
  {
    SMBUS_TransferConfig(p_i2cx, 0, hsmbus->xfer_size,
                         SMBUS_RELOAD_MODE | ((uint32_t)hsmbus->xfer_opt & SMBUS_SENDPEC_MODE),
                         SMBUS_NO_STARTSTOP);
  }
  else
  {
    /* Set NBYTE to transmit */
    SMBUS_TransferConfig(p_i2cx, 0, hsmbus->xfer_size, (uint32_t)hsmbus->xfer_opt,
                         SMBUS_NO_STARTSTOP);

    /* If PEC mode is enabled, size to transmit must be size_byte-1 byte, corresponding to PEC byte */
    /* PEC byte is automatically sent by HW block, no need to manage it in Transmit process */
    if (LL_I2C_IsEnabledSMBusPEC(p_i2cx) != 0U)
    {
      if (hsmbus->xfer_size > 0U)
      {
        hsmbus->xfer_size--;
        hsmbus->xfer_count--;
      }
      else
      {
        hsmbus->global_state = HAL_SMBUS_STATE_IDLE;
        return HAL_ERROR;
      }
    }
  }

  /* Clear ADDR flag after prepare the transfer parameters */
  /* This action will generate an acknowledge to the HOST */
  LL_I2C_ClearFlag_ADDR(p_i2cx);

  /* Re-enable ADDR interrupt */
  SMBUS_Enable_IRQ(hsmbus, SMBUS_TX_IT_MASK | SMBUS_ADDR_IT_MASK);

  return HAL_OK;

}

/**
  * @brief  Sequential receive in slave/device SMBUS mode an amount of data in non-blocking mode with Interrupt.
  * @param  hsmbus Pointer to a @ref hal_smbus_handle_t
  * @param  p_data Pointer to data buffer
  * @param  size_byte Amount of data to receive in bytes
  * @param  xfer_opt Options of Transfer
  * @note   This interface allows to manage repeated start condition when a direction change during transfer
  * @retval HAL_OK            Operation started successfully
  * @retval HAL_BUSY          Concurrent process ongoing
  * @retval HAL_INVALID_PARAM Invalid parameter
  */
hal_status_t HAL_SMBUS_SLAVE_SEQ_Receive_IT(hal_smbus_handle_t *hsmbus, void *p_data, uint32_t size_byte,
                                            hal_smbus_xfer_opt_t xfer_opt)
{
  I2C_TypeDef *p_i2cx;

  ASSERT_DBG_PARAM((hsmbus != NULL));
  /* Allowed parameters, if size_byte is equals to 0 and p_data is equals to NULL */
  ASSERT_DBG_PARAM((p_data != NULL) || (size_byte == 0U));
  ASSERT_DBG_PARAM(IS_SMBUS_TRANSFER_OPTIONS_REQUEST(xfer_opt));

  ASSERT_DBG_STATE(hsmbus->global_state, (uint32_t)HAL_SMBUS_STATE_LISTEN | (uint32_t)HAL_SMBUS_STATE_RX_LISTEN
                   | (uint32_t)HAL_SMBUS_STATE_TX_LISTEN);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_data == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

#if defined(USE_HAL_CHECK_PROCESS_STATE) && (USE_HAL_CHECK_PROCESS_STATE == 1)
  if (((uint32_t)hsmbus->global_state & ((uint32_t)HAL_SMBUS_STATE_LISTEN | (uint32_t)HAL_SMBUS_STATE_RX_LISTEN
                                         | (uint32_t)HAL_SMBUS_STATE_TX_LISTEN)) == 0U)
  {
    return HAL_BUSY;
  }
#endif /* USE_HAL_CHECK_PROCESS_STATE */

  p_i2cx = I2C_GET_INSTANCE(hsmbus);

  /* Disable Interrupts, to prevent preemption during treatment in case of multicall */
  SMBUS_Disable_IRQ(hsmbus, SMBUS_ADDR_IT_MASK | SMBUS_TX_IT_MASK);

  hsmbus->global_state = (HAL_SMBUS_STATE_RX_LISTEN);

  /* Set SBC bit in CR1 to manage Acknowledge at each bit */
  LL_I2C_EnableSlaveByteControl(p_i2cx);

  LL_I2C_AcknowledgeEnable(p_i2cx);

  /* Prepare transfer parameters */
  hsmbus->p_buf_rx = (uint8_t *)p_data;
  hsmbus->xfer_count = size_byte;
  hsmbus->xfer_size = size_byte;
  hsmbus->xfer_opt = xfer_opt;
  hsmbus->xfer_isr = SMBUS_Slave_ISR;
  hsmbus->last_error_codes = HAL_SMBUS_ERROR_NONE;

  /* Convert OTHER_xxx XferOptions if any */
  SMBUS_ConvertOtherXferOptions(hsmbus);

  /* If XferSize equal "1", or XferSize equal "2" with PEC requested (mean 1 data byte + 1 PEC byte */
  /* no need to set RELOAD bit mode, a ACK will be automatically generated in that case */
  /* else need to set RELOAD bit mode to generate an automatic ACK at each byte Received */
  /* This RELOAD bit will be reset for last BYTE to be receive in SMBUS_Slave_ISR */
  if (((LL_I2C_IsEnabledSMBusPEC(p_i2cx) != 0U) && (hsmbus->xfer_size == 2U)) || (hsmbus->xfer_size == 1U))
  {
    SMBUS_TransferConfig(p_i2cx, 0, (uint8_t)hsmbus->xfer_size, (uint32_t)hsmbus->xfer_opt,
                         SMBUS_NO_STARTSTOP);
  }
  else
  {
    SMBUS_TransferConfig(p_i2cx, 0, 1, (uint32_t)hsmbus->xfer_opt | SMBUS_RELOAD_MODE, SMBUS_NO_STARTSTOP);
  }

  /* Clear ADDR flag after prepare the transfer parameters */
  /* This action will generate an acknowledge to the HOST */
  LL_I2C_ClearFlag_ADDR(p_i2cx);

  /* Enable ADDR interrupt */
  SMBUS_Enable_IRQ(hsmbus, SMBUS_RX_IT_MASK | SMBUS_ADDR_IT_MASK);

  return HAL_OK;
}

/**
  * @brief  Enable the Address listen mode with Interrupt.
  * @param  hsmbus Pointer to a @ref hal_smbus_handle_t
  * @retval HAL_OK    Operation started successfully
  * @retval HAL_BUSY  Concurrent process ongoing
  */
hal_status_t HAL_SMBUS_SLAVE_EnableListen_IT(hal_smbus_handle_t *hsmbus)
{
  ASSERT_DBG_PARAM((hsmbus != NULL));

  ASSERT_DBG_STATE(hsmbus->global_state, HAL_SMBUS_STATE_IDLE);

  HAL_CHECK_UPDATE_STATE(hsmbus, global_state, HAL_SMBUS_STATE_IDLE, HAL_SMBUS_STATE_LISTEN);

  hsmbus->xfer_isr = SMBUS_Slave_ISR;

  /* Enable the Address Match interrupt */
  SMBUS_Enable_IRQ(hsmbus, SMBUS_ADDR_IT_MASK);

  return HAL_OK;
}

/**
  * @brief  Disable the Address listen mode with Interrupt.
  * @param  hsmbus Pointer to a @ref hal_smbus_handle_t
  * @retval HAL_OK            Operation started successfully
  * @retval HAL_BUSY          Concurrent process ongoing
  */
hal_status_t HAL_SMBUS_SLAVE_DisableListen_IT(hal_smbus_handle_t *hsmbus)
{
  ASSERT_DBG_PARAM((hsmbus != NULL));

