MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_smbus.c
  ASSERT_DBG_STATE(hsmbus->global_state, HAL_SMBUS_STATE_LISTEN);

  HAL_CHECK_UPDATE_STATE(hsmbus, global_state, HAL_SMBUS_STATE_LISTEN, HAL_SMBUS_STATE_IDLE);

  /* Disable the Address Match interrupt */
  SMBUS_Disable_IRQ(hsmbus, SMBUS_ADDR_IT_MASK);

  hsmbus->previous_state = SMBUS_STATE_NONE;
  hsmbus->xfer_isr = NULL;

  return HAL_OK;
}

/**
  * @brief  Abort a master SMBUS process communication with Interrupt.
  * @param  hsmbus Pointer to a @ref hal_smbus_handle_t
  * @param  device_addr Target device address: The device 7 bits address value
  *         in datasheet must be shifted to the left before calling the interface
  * @retval HAL_OK            Operation started successfully
  * @retval HAL_ERROR         Mode is not Master
  * @retval HAL_BUSY          No process ongoing
  */
hal_status_t HAL_SMBUS_MASTER_Abort_IT(hal_smbus_handle_t *hsmbus, uint32_t device_addr)
{
  ASSERT_DBG_PARAM((hsmbus != NULL));

  ASSERT_DBG_STATE(hsmbus->global_state, (uint32_t)HAL_SMBUS_STATE_TX | (uint32_t)HAL_SMBUS_STATE_RX
                   | (uint32_t)HAL_SMBUS_STATE_LISTEN | (uint32_t)HAL_SMBUS_STATE_RX_LISTEN
                   | (uint32_t)HAL_SMBUS_STATE_TX_LISTEN | (uint32_t)HAL_SMBUS_STATE_IDLE);

  I2C_TypeDef *p_i2cx = I2C_GET_INSTANCE(hsmbus);

  if (LL_I2C_GetMode(p_i2cx) == (uint32_t)HAL_SMBUS_PERIPHERAL_MODE_HOST)
  {
    /* Disable Interrupts and Store Previous state */
    if (hsmbus->global_state == HAL_SMBUS_STATE_TX)
    {
      SMBUS_Enable_IRQ(hsmbus, SMBUS_TX_IT_MASK);
      hsmbus->previous_state = (uint32_t)HAL_SMBUS_STATE_TX;
    }
    else if (hsmbus->global_state == HAL_SMBUS_STATE_RX)
    {
      SMBUS_Enable_IRQ(hsmbus, SMBUS_RX_IT_MASK);
      hsmbus->previous_state = (uint32_t)HAL_SMBUS_STATE_RX;
    }
    else
    {
      /* Do nothing */
    }

    hsmbus->global_state = HAL_SMBUS_STATE_ABORT;

    /* Set NBYTES to 1 to generate a dummy read on SMBUS functionality in the I2Cx peripheral */
    /* Set AUTOEND mode, this will generate a NACK then STOP condition to abort the current transfer */
    SMBUS_TransferConfig(p_i2cx, device_addr, 1, LL_I2C_MODE_AUTOEND, SMBUS_GENERATE_STOP);
    LL_I2C_EnableIT(p_i2cx, LL_I2C_CR1_STOPIE);

    return HAL_OK;
  }
  else
  {
    /* Wrong usage of abort function */
    /* This function must be used only in case of abort monitored by master device */
    return HAL_ERROR;
  }
}

/**
  * @brief  Abort a slave SMBUS process communication with Interrupt.
  * @param  hsmbus Pointer to a @ref hal_smbus_handle_t
  * @retval HAL_OK            Operation started successfully
  * @retval HAL_ERROR         Mode is not Slave
  */
hal_status_t HAL_SMBUS_SLAVE_Abort_IT(hal_smbus_handle_t *hsmbus)
{
  I2C_TypeDef *p_i2cx;

  ASSERT_DBG_PARAM((hsmbus != NULL));

  ASSERT_DBG_STATE(hsmbus->global_state, (uint32_t)HAL_SMBUS_STATE_TX | (uint32_t)HAL_SMBUS_STATE_RX
                   | (uint32_t)HAL_SMBUS_STATE_LISTEN | (uint32_t)HAL_SMBUS_STATE_RX_LISTEN
                   | (uint32_t)HAL_SMBUS_STATE_TX_LISTEN | (uint32_t)HAL_SMBUS_STATE_IDLE);

  p_i2cx = I2C_GET_INSTANCE(hsmbus);

  if ((hal_smbus_mode_t)LL_I2C_GetMode(p_i2cx) == HAL_SMBUS_PERIPHERAL_MODE_SLAVE)
  {
    hsmbus->global_state = HAL_SMBUS_STATE_ABORT;

    LL_I2C_AcknowledgeNextData(p_i2cx, LL_I2C_NACK);
    return HAL_OK;
  }
  else
  {
    /* Wrong usage of abort function */
    /* This function must be used only in case of abort monitored by slave device */
    return HAL_ERROR;
  }
}
/**
  * @}
  */

/** @addtogroup SMBUS_Exported_Functions_Group4
  * @{
  This subsection provides the function handling the interruption of the SMBUS.
  - SMBUS Event IRQ Handler : HAL_SMBUS_EV_IRQHandler()
  - SMBUS Error IRQ Handler : HAL_SMBUS_ERR_IRQHandler()

  Depending on the process function one's use, different callback might be triggered:

| Process API \n \ \n Callbacks      | HAL_SMBUS_MASTER_SEQ_Transmit_IT | HAL_SMBUS_MASTER_SEQ_Receive_IT |
|------------------------------------|:-------------------------------:|:------------------------------:|
| HAL_SMBUS_MASTER_TxCpltCallback    |                x                |                                |
| HAL_SMBUS_MASTER_RxCpltCallback    |                                 |                  x             |
| HAL_SMBUS_ErrorCallback            |                x                |                  x             |
| HAL_SMBUS_AbortCpltCallback*       |                x                |                  x             |
@note * HAL_SMBUS_AbortCpltCallback is called by the ISR when the abort is requested by the slave (using NACK) or
        the master (by generating STOP)

| Process API \n \ \n Callbacks      | HAL_SMBUS_SLAVE_SEQ_Transmit_IT  |  HAL_SMBUS_SLAVE_SEQ_Receive_IT |
|------------------------------------|:-------------------------------:|:------------------------------:|
| HAL_SMBUS_SLAVE_TxCpltCallback     |                x                |                                |
| HAL_SMBUS_SLAVE_RxCpltCallback     |                                 |                  x             |
| HAL_SMBUS_SLAVE_ListenCpltCallback |                x                |                  x             |
| HAL_SMBUS_ErrorCallback            |                x                |                  x             |
@note HAL_SMBUS_SLAVE_EnableListen_IT must be called before HAL_SMBUS_SLAVE_SEQ_Transmit_IT and
      HAL_SMBUS_SLAVE_SEQ_Receive_IT

| Process API \n \ \n Callbacks      | HAL_SMBUS_SLAVE_EnableListen_IT |
|------------------------------------|:-------------------------------:|
| HAL_SMBUS_SLAVE_AddrCallback       |                x                |

| Process API \n \ \n Callbacks      |    HAL_SMBUS_MASTER_Abort_IT    |    HAL_SMBUS_SLAVE_Abort_IT    |
|------------------------------------|:-------------------------------:|:------------------------------:|
| HAL_SMBUS_AbortCpltCallback        |                x                |                  x             |
  */

/**
  * @brief  Handle SMBUS event interrupt request.
  * @param  hsmbus Pointer to a @ref hal_smbus_handle_t structure that contains
  *                the configuration information for the specified SMBUS.
  */
void HAL_SMBUS_EV_IRQHandler(hal_smbus_handle_t *hsmbus)
{
  ASSERT_DBG_PARAM((hsmbus != NULL));

  I2C_TypeDef *p_i2cx = I2C_GET_INSTANCE(hsmbus);

  /* Get current IT Flags and IT sources value */
  uint32_t it_flags   = LL_I2C_READ_REG(p_i2cx, ISR);
  uint32_t it_sources = LL_I2C_READ_REG(p_i2cx, CR1);

  /* SMBUS events treatment */
  if (hsmbus->xfer_isr != NULL)
  {
    hsmbus->xfer_isr(hsmbus, it_flags, it_sources);
  }
}
/**
  * @brief  Handle SMBUS error interrupt request.
  * @param  hsmbus Pointer to a @ref hal_smbus_handle_t structure that contains
  *                the configuration information for the specified SMBUS.
  */
void HAL_SMBUS_ERR_IRQHandler(hal_smbus_handle_t *hsmbus)
{
  ASSERT_DBG_PARAM((hsmbus != NULL));

  SMBUS_ITErrorHandler(hsmbus);
}

/**
  * @}
  */

/** @addtogroup SMBUS_Exported_Functions_Group5
  * @{
A set of weak functions (or default callbacks functions if USE_HAL_SMBUS_REGISTER_CALLBACKS is set to 1U) which are used
to asynchronously informed the application in non blocking modes (Interrupt) :
 - HAL_SMBUS_MASTER_TxCpltCallback()     : Master Tx Transfer completed callback
 - HAL_SMBUS_MASTER_RxCpltCallback()     : Master Rx Transfer completed callback
 - HAL_SMBUS_SLAVE_TxCpltCallback()      : Slave Tx Transfer completed callback
 - HAL_SMBUS_SLAVE_RxCpltCallback()      : Slave Rx Transfer completed callback
 - HAL_SMBUS_SLAVE_AddrCallback()        : Slave Address Match callback
 - HAL_SMBUS_SLAVE_ListenCpltCallback()  : Slave listen completed callback
 - HAL_SMBUS_ErrorCallback()             : SMBUS error callback
 - HAL_SMBUS_AbortCpltCallback()         : SMBUS abort complete callback
 */

/**
  * @brief  Master Tx transfer completed callback.
  * @param  hsmbus Pointer to a @ref hal_smbus_handle_t
  */
__WEAK void HAL_SMBUS_MASTER_TxCpltCallback(hal_smbus_handle_t *hsmbus)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hsmbus);

  /** @warning : This function must not be modified, when the callback is needed,
    *            the HAL_SMBUS_MASTER_TxCpltCallback could be implemented in the user file
    */
}

/**
  * @brief  Master Rx transfer completed callback.
  * @param  hsmbus Pointer to a @ref hal_smbus_handle_t
  */
__WEAK void HAL_SMBUS_MASTER_RxCpltCallback(hal_smbus_handle_t *hsmbus)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hsmbus);

  /** @warning : This function must not be modified, when the callback is needed,
    *            the HAL_SMBUS_MASTER_RxCpltCallback could be implemented in the user file
    */
}

/**
  * @brief  Slave Tx transfer completed callback.
  * @param  hsmbus Pointer to a @ref hal_smbus_handle_t
  */
__WEAK void HAL_SMBUS_SLAVE_TxCpltCallback(hal_smbus_handle_t *hsmbus)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hsmbus);

  /** @warning : This function must not be modified, when the callback is needed,
    *            the HAL_SMBUS_SLAVE_TxCpltCallback could be implemented in the user file
    */
}

/**
  * @brief  Slave Rx transfer completed callback.
  * @param  hsmbus Pointer to a @ref hal_smbus_handle_t
  */
__WEAK void HAL_SMBUS_SLAVE_RxCpltCallback(hal_smbus_handle_t *hsmbus)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hsmbus);

  /** @warning : This function must not be modified, when the callback is needed,
    *            the HAL_SMBUS_SLAVE_RxCpltCallback could be implemented in the user file
    */
}

/**
  * @brief  Slave address match callback.
  * @param  hsmbus Pointer to a @ref hal_smbus_handle_t
  * @param  xfer_direction Master request Transfer Direction (Write/Read)
  * @param  addr_match_code Address Match Code
  */
__WEAK void HAL_SMBUS_SLAVE_AddrCallback(hal_smbus_handle_t *hsmbus,
                                         hal_smbus_slave_xfer_direction_t xfer_direction,
                                         uint32_t addr_match_code)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hsmbus);
  STM32_UNUSED(xfer_direction);
  STM32_UNUSED(addr_match_code);

  /** @warning : This function must not be modified, when the callback is needed,
    *            the HAL_SMBUS_SLAVE_AddrCallback() could be implemented in the user file
    */
}

/**
  * @brief  Slave listen complete callback.
  * @param  hsmbus Pointer to a @ref hal_smbus_handle_t
  */
__WEAK void HAL_SMBUS_SLAVE_ListenCpltCallback(hal_smbus_handle_t *hsmbus)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hsmbus);

  /** @warning : This function must not be modified, when the callback is needed,
    *            the HAL_SMBUS_SLAVE_ListenCpltCallback() could be implemented in the user file
    */
}

/**
  * @brief  SMBUS error callback.
  * @param  hsmbus Pointer to a @ref hal_smbus_handle_t
  */
__WEAK void HAL_SMBUS_ErrorCallback(hal_smbus_handle_t *hsmbus)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hsmbus);

  /** @warning : This function must not be modified, when the callback is needed,
    *            the HAL_SMBUS_ErrorCallback could be implemented in the user file
    */
}

/**
  * @brief  SMBUS abort complete callback.
  * @param  hsmbus Pointer to a @ref hal_smbus_handle_t
  */
__WEAK void HAL_SMBUS_AbortCpltCallback(hal_smbus_handle_t *hsmbus)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hsmbus);

  /** @warning : This function must not be modified, when the callback is needed,
    *            the HAL_SMBUS_AbortCpltCallback could be implemented in the user file
    */
}

/**
  * @}
  */

/** @addtogroup SMBUS_Exported_Functions_Group6
  * @{
A set of functions to retrieve peripheral state and last process errors.
 - HAL_SMBUS_GetState(): Return the SMBUS handle state.
 - HAL_SMBUS_GetLastErrorCodes(): Return errors limited to the last process.
 - HAL_SMBUS_GetClockFreq(): Retrieve the HAL SMBUS instance kernel clock frequency.
  */

/**
  * @brief  Return the SMBUS handle state.
  * @param  hsmbus Pointer to a @ref hal_smbus_handle_t.
  * @retval HAL state.
  */
hal_smbus_state_t HAL_SMBUS_GetState(const hal_smbus_handle_t *hsmbus)
{
  ASSERT_DBG_PARAM((hsmbus != NULL));

  /* Return SMBUS handle state */
  return hsmbus->global_state;
}

#if defined (USE_HAL_SMBUS_GET_LAST_ERRORS) && (USE_HAL_SMBUS_GET_LAST_ERRORS == 1)
/**
  * @brief  Return errors limited to the last process.
  * @param  hsmbus Pointer to a @ref hal_smbus_handle_t
  * @retval uint32_t Last error code. It can be NULL or a combinaison of the following values:
  *         @arg @ref HAL_SMBUS_ERROR_BERR,
  *         @arg @ref HAL_SMBUS_ERROR_ARLO,
  *         @arg @ref HAL_SMBUS_ERROR_ACKF,
  *         @arg @ref HAL_SMBUS_ERROR_OVR,
  *         @arg @ref HAL_SMBUS_ERROR_BUSTIMEOUT,
  *         @arg @ref HAL_SMBUS_ERROR_ALERT,
  *         @arg @ref HAL_SMBUS_ERROR_PECERR,
  */
uint32_t HAL_SMBUS_GetLastErrorCodes(const hal_smbus_handle_t *hsmbus)
{
  ASSERT_DBG_PARAM((hsmbus != NULL));

