MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_smbus.c
  ASSERT_DBG_STATE(hsmbus->global_state, (uint32_t)HAL_SMBUS_STATE_IDLE | (uint32_t)HAL_SMBUS_STATE_TX
                   | (uint32_t)HAL_SMBUS_STATE_RX | (uint32_t)HAL_SMBUS_STATE_LISTEN
                   | (uint32_t)HAL_SMBUS_STATE_RX_LISTEN | (uint32_t)HAL_SMBUS_STATE_TX_LISTEN
                   | (uint32_t)HAL_SMBUS_STATE_ABORT);

  return hsmbus->last_error_codes;
}
#endif /* USE_HAL_SMBUS_GET_LAST_ERRORS */

/** @brief  Return the peripheral clock frequency for SMBUS.
  * @param  hsmbus Pointer to a @ref hal_smbus_handle_t
  * @retval uint32_t Frequency in Hz.
  *                  0 if the source clock of the SMBUS is not configured or not ready.
  */
uint32_t HAL_SMBUS_GetClockFreq(const hal_smbus_handle_t *hsmbus)
{
  /* Check the parameters */
  ASSERT_DBG_PARAM((hsmbus != NULL));
  ASSERT_DBG_STATE(hsmbus->global_state, (uint32_t)HAL_SMBUS_STATE_INIT | (uint32_t)HAL_SMBUS_STATE_IDLE
                   | (uint32_t)HAL_SMBUS_STATE_TX | (uint32_t)HAL_SMBUS_STATE_RX
                   | (uint32_t)HAL_SMBUS_STATE_LISTEN | (uint32_t)HAL_SMBUS_STATE_RX_LISTEN
                   | (uint32_t)HAL_SMBUS_STATE_TX_LISTEN | (uint32_t)HAL_SMBUS_STATE_ABORT);

  return HAL_RCC_I2C_GetKernelClkFreq((I2C_TypeDef *)((uint32_t)hsmbus->instance));
}
/**
  * @}
  */

#if defined(USE_HAL_MUTEX) && (USE_HAL_MUTEX == 1)
/** @addtogroup SMBUS_Exported_Functions_Group7
  * @{
A set of functions to acquire and release the bus based on the HAL OS abstraction layer (stm32_hal_os.c/.h osal):
 - HAL_SMBUS_AcquireBus(): Acquire the SMBUS bus.
 - HAL_SMBUS_ReleaseBus(): Release the SMBUS bus.
  */

/**
  * @brief  Acquire the SMBUS bus using the HAL OS abstraction layer (stm32_hal_os.c/.h osal).
  * @param  hsmbus Pointer to a @ref hal_smbus_handle_t.
  * @param  timeout_ms Timeout duration in milliseconds.
  * @note   Call HAL_SMBUS_AcquireBus from thread mode only (not from handler mode, e.g., from ISR).
  * @retval HAL_OK    Operation completed successfully.
  * @retval HAL_ERROR Operation completed with error.
  */
hal_status_t HAL_SMBUS_AcquireBus(hal_smbus_handle_t *hsmbus, uint32_t timeout_ms)
{
  hal_status_t status = HAL_ERROR;

  ASSERT_DBG_PARAM((hsmbus != NULL));

  ASSERT_DBG_STATE(hsmbus->global_state, (uint32_t)HAL_SMBUS_STATE_INIT | (uint32_t)HAL_SMBUS_STATE_IDLE
                   | (uint32_t)HAL_SMBUS_STATE_TX | (uint32_t)HAL_SMBUS_STATE_RX
                   | (uint32_t)HAL_SMBUS_STATE_LISTEN | (uint32_t)HAL_SMBUS_STATE_RX_LISTEN
                   | (uint32_t)HAL_SMBUS_STATE_TX_LISTEN | (uint32_t)HAL_SMBUS_STATE_ABORT);

  if (HAL_OS_SemaphoreTake(&hsmbus->semaphore, timeout_ms) == HAL_OS_OK)
  {
    status = HAL_OK;
  }

  return status;
}

/**
  * @brief  Release the SMBUS bus thanks to the the HAL OS abstraction layer (stm32_hal_os.c/.h osal).
  * @param  hsmbus Pointer to a @ref hal_smbus_handle_t
  * @note   The HAL_SMBUS_ReleaseBus can be called from thread mode or from handler mode e.g from ISR.
  * @retval HAL_OK    Operation completed successfully
  * @retval HAL_ERROR Operation completed with error
  */
hal_status_t HAL_SMBUS_ReleaseBus(hal_smbus_handle_t *hsmbus)
{
  hal_status_t status = HAL_ERROR;
  ASSERT_DBG_PARAM((hsmbus != NULL));

  ASSERT_DBG_STATE(hsmbus->global_state, (uint32_t)HAL_SMBUS_STATE_INIT | (uint32_t)HAL_SMBUS_STATE_IDLE
                   | (uint32_t)HAL_SMBUS_STATE_TX | (uint32_t)HAL_SMBUS_STATE_RX
                   | (uint32_t)HAL_SMBUS_STATE_LISTEN | (uint32_t)HAL_SMBUS_STATE_RX_LISTEN
                   | (uint32_t)HAL_SMBUS_STATE_TX_LISTEN | (uint32_t)HAL_SMBUS_STATE_ABORT);

  if (HAL_OS_SemaphoreRelease(&hsmbus->semaphore) == HAL_OS_OK)
  {
    status = HAL_OK;
  }

  return status;
}

/**
  * @}
  */
#endif /* USE_HAL_MUTEX */

#if defined (USE_HAL_SMBUS_USER_DATA) && (USE_HAL_SMBUS_USER_DATA == 1)
/** @addtogroup SMBUS_Exported_Functions_Group8
  * @{
A set of functions to manage a user data pointer stored in the SMBUS handle:
 - HAL_SMBUS_SetUserData(): Set the user data in the handle.
 - HAL_SMBUS_GetUserData(): Get the user data from the handle.
  */

/**
  * @brief Set the user data pointer in the handle.
  * @param hsmbus Pointer to a @ref hal_smbus_handle_t.
  * @param p_user_data Pointer to the user data.
  */
void HAL_SMBUS_SetUserData(hal_smbus_handle_t *hsmbus, const void *p_user_data)
{
  ASSERT_DBG_PARAM(hsmbus != NULL);

  hsmbus->p_user_data = p_user_data;
}

/**
  * @brief  Get the user data pointer from the handle.
  * @param  hsmbus Pointer to a @ref hal_smbus_handle_t.
  * @retval Pointer to the user data.
  */
const void *HAL_SMBUS_GetUserData(const hal_smbus_handle_t *hsmbus)
{
  ASSERT_DBG_PARAM(hsmbus != NULL);

  return (hsmbus->p_user_data);
}
/**
  * @}
  */
#endif /* USE_HAL_SMBUS_USER_DATA */
/**
  * @}
  */

/** @addtogroup SMBUS_Private_Functions SMBUS Private Functions
  * @{
  */

/**
  * @brief  Interrupt Sub-Routine which handle the Interrupt Flags Master Mode.
  * @param  hsmbus Pointer to a @ref hal_smbus_handle_t structure that contains
  *                the configuration information for the specified SMBUS.
  * @param  it_flags Value of Interrupt Flags.
  * @param  it_sources Interrupt sources enabled.
  * @retval HAL status
  */
static hal_status_t SMBUS_Master_ISR(hal_smbus_handle_t *hsmbus, uint32_t it_flags, uint32_t it_sources)
{
  uint16_t device_addr;

  I2C_TypeDef *p_i2cx = I2C_GET_INSTANCE(hsmbus);

  if (SMBUS_CHECK_FLAG(it_flags, LL_I2C_ISR_NACKF) != 0U)
  {
    LL_I2C_ClearFlag_NACK(p_i2cx);

    /* Set corresponding error code */
    /* No need to generate STOP, it is automatically done */
    hsmbus->last_error_codes |= HAL_SMBUS_ERROR_ACKF;

    SMBUS_Flush_TXDR(hsmbus);

    /* Call the error callback to inform upper layer */
#if defined (USE_HAL_SMBUS_REGISTER_CALLBACKS) && (USE_HAL_SMBUS_REGISTER_CALLBACKS == 1)
    hsmbus->p_error_cb(hsmbus);
#else
    HAL_SMBUS_ErrorCallback(hsmbus);
#endif /* USE_HAL_SMBUS_REGISTER_CALLBACKS */
  }
  else if (SMBUS_CHECK_FLAG(it_flags, LL_I2C_ISR_STOPF) != 0U)
  {
    /* Check and treat errors if errors occurs during STOP process */
    SMBUS_ITErrorHandler(hsmbus);

    /* Call the corresponding callback to inform upper layer of End of Transfer */
    if (hsmbus->global_state == HAL_SMBUS_STATE_TX)
    {
      SMBUS_Disable_IRQ(hsmbus, SMBUS_TX_IT_MASK);

