MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_smbus.c
      LL_I2C_ClearFlag_STOP(p_i2cx);

      /* Clear configuration register 2 */
      STM32_CLEAR_BIT(p_i2cx->CR2, I2C_CR2_SADD | I2C_CR2_HEAD10R | I2C_CR2_NBYTES
                      | LL_I2C_MODE_RELOAD | LL_I2C_REQUEST_READ);

      /* Flush remaining data in Fifo register in case of error occurs before TXEmpty */
      /* Disable the selected SMBUS functionality in the I2Cx peripheral */
      LL_I2C_Disable(p_i2cx);

      hsmbus->previous_state = (uint32_t)HAL_SMBUS_STATE_IDLE;
      hsmbus->global_state = HAL_SMBUS_STATE_IDLE;

      /* Re-enable the selected SMBUS functionality in the I2Cx peripheral */
      LL_I2C_Enable(p_i2cx);

      /* Call the corresponding callback to inform upper layer of end of transfer */
#if defined (USE_HAL_SMBUS_REGISTER_CALLBACKS) && (USE_HAL_SMBUS_REGISTER_CALLBACKS == 1)
      hsmbus->p_master_tx_cplt_cb(hsmbus);
#else
      HAL_SMBUS_MASTER_TxCpltCallback(hsmbus);
#endif /* USE_HAL_SMBUS_REGISTER_CALLBACKS */
    }
    else if (hsmbus->global_state == HAL_SMBUS_STATE_RX)
    {
      /* Store last receive data if any */
      if ((SMBUS_CHECK_FLAG(it_flags, LL_I2C_ISR_RXNE) != 0U)
          && (SMBUS_CHECK_IT_SOURCE(it_sources, LL_I2C_CR1_RXIE) != 0U))
      {
        /* Read data from RXDR */
        *hsmbus->p_buf_rx = LL_I2C_ReceiveData8(p_i2cx);

        /* Increment buffer pointer */
        hsmbus->p_buf_rx++;

        if ((hsmbus->xfer_size > 0U))
        {
          hsmbus->xfer_size--;
          hsmbus->xfer_count--;
        }
      }

      SMBUS_Disable_IRQ(hsmbus, SMBUS_RX_IT_MASK);

      LL_I2C_ClearFlag_STOP(p_i2cx);

      /* Clear configuration register 2 */
      STM32_CLEAR_BIT(p_i2cx->CR2, I2C_CR2_SADD | I2C_CR2_HEAD10R | I2C_CR2_NBYTES
                      | LL_I2C_MODE_RELOAD | LL_I2C_REQUEST_READ);

      hsmbus->previous_state = (uint32_t)HAL_SMBUS_STATE_IDLE;
      hsmbus->global_state = HAL_SMBUS_STATE_IDLE;

      /* Call the corresponding callback to inform upper layer of End of Transfer */
#if defined (USE_HAL_SMBUS_REGISTER_CALLBACKS) && (USE_HAL_SMBUS_REGISTER_CALLBACKS == 1)
      hsmbus->p_master_rx_cplt_cb(hsmbus);
#else
      HAL_SMBUS_MASTER_RxCpltCallback(hsmbus);
#endif /* USE_HAL_SMBUS_REGISTER_CALLBACKS */
    }
    else if (hsmbus->global_state == HAL_SMBUS_STATE_ABORT)
    {
      SMBUS_Disable_IRQ(hsmbus, (SMBUS_TX_IT_MASK | SMBUS_RX_IT_MASK));

      LL_I2C_ClearFlag_STOP(p_i2cx);

      /* Clear Configuration Register 2 */
      STM32_CLEAR_BIT(p_i2cx->CR2, I2C_CR2_SADD | I2C_CR2_HEAD10R | I2C_CR2_NBYTES
                      | LL_I2C_MODE_RELOAD | LL_I2C_REQUEST_READ);

      /* Flush remaining data in Fifo register in case of error occurs before TXEmpty */
      /* Disable the selected SMBUS functionality in the I2Cx peripheral */
      LL_I2C_Disable(p_i2cx);

      hsmbus->previous_state = (uint32_t)HAL_SMBUS_STATE_IDLE;
      hsmbus->global_state = HAL_SMBUS_STATE_IDLE;

      SMBUS_Flush_TXDR(hsmbus);

      /* Re-enable the selected SMBUS functionality in the I2Cx peripheral */
      LL_I2C_Enable(p_i2cx);

#if defined (USE_HAL_SMBUS_REGISTER_CALLBACKS) && (USE_HAL_SMBUS_REGISTER_CALLBACKS == 1)
      hsmbus->p_abort_cplt_cb(hsmbus);
#else
      HAL_SMBUS_AbortCpltCallback(hsmbus);
#endif /* USE_HAL_SMBUS_REGISTER_CALLBACKS */
    }
    else
    {
      /* Nothing to do */
    }
  }
  else if (SMBUS_CHECK_FLAG(it_flags, LL_I2C_ISR_RXNE) != 0U)
  {
    /* Read data from RXDR */
    *hsmbus->p_buf_rx = LL_I2C_ReceiveData8(p_i2cx);

    /* Increment buffer pointer */
    hsmbus->p_buf_rx++;

    /* Increment size counter */
    hsmbus->xfer_size--;
    hsmbus->xfer_count--;
  }
  else if (SMBUS_CHECK_FLAG(it_flags, LL_I2C_ISR_TXIS) != 0U)
  {
    /* Write data to TXDR */
    LL_I2C_TransmitData8(p_i2cx, *hsmbus->p_buf_tx);

    /* Increment buffer pointer */
    hsmbus->p_buf_tx++;

    /* Increment size counter */
    hsmbus->xfer_size--;
    hsmbus->xfer_count--;
  }
  else if (SMBUS_CHECK_FLAG(it_flags, LL_I2C_ISR_TCR) != 0U)
  {
    if ((hsmbus->xfer_count != 0U) && (hsmbus->xfer_size == 0U))
    {
      device_addr = (uint16_t)LL_I2C_GetSlaveAddr(p_i2cx);

      if (hsmbus->xfer_count > MAX_NBYTE_SIZE)
      {
        SMBUS_TransferConfig(p_i2cx, device_addr, MAX_NBYTE_SIZE,
                             (SMBUS_RELOAD_MODE | ((uint32_t)hsmbus->xfer_opt & SMBUS_SENDPEC_MODE)),
                             SMBUS_NO_STARTSTOP);
        hsmbus->xfer_size = MAX_NBYTE_SIZE;
      }
      else
      {
        hsmbus->xfer_size = hsmbus->xfer_count;
        SMBUS_TransferConfig(p_i2cx, device_addr, hsmbus->xfer_size, (uint32_t)hsmbus->xfer_opt,
                             SMBUS_NO_STARTSTOP);
        /* If PEC mode is enabled, size to transmit must be Size-1 byte, corresponding to PEC byte */
        /* PEC byte is automatically sent by HW block, no need to manage it in transmit process */
        if (LL_I2C_IsEnabledSMBusPEC(p_i2cx) != 0U)
        {
          hsmbus->xfer_size--;
          hsmbus->xfer_count--;
        }
      }
    }
    else if ((hsmbus->xfer_count == 0U) && (hsmbus->xfer_size == 0U))
    {
      /* Call TxCpltCallback() if no stop mode is set */
      if (SMBUS_GET_STOP_MODE(hsmbus) != SMBUS_AUTOEND_MODE)
      {
        /* Call the corresponding callback to inform upper layer of end of transfer */
        if (hsmbus->global_state == HAL_SMBUS_STATE_TX)
        {
          SMBUS_Disable_IRQ(hsmbus, SMBUS_TX_IT_MASK);
          hsmbus->previous_state = (uint32_t)hsmbus->global_state;
          hsmbus->global_state = HAL_SMBUS_STATE_IDLE;

          /* Call the corresponding callback to inform upper layer of end of transfer */
#if defined (USE_HAL_SMBUS_REGISTER_CALLBACKS) && (USE_HAL_SMBUS_REGISTER_CALLBACKS == 1)
          hsmbus->p_master_tx_cplt_cb(hsmbus);
#else
          HAL_SMBUS_MASTER_TxCpltCallback(hsmbus);
#endif /* USE_HAL_SMBUS_REGISTER_CALLBACKS */
        }
        else if (hsmbus->global_state == HAL_SMBUS_STATE_RX)
        {
          SMBUS_Disable_IRQ(hsmbus, SMBUS_RX_IT_MASK);
          hsmbus->previous_state = (uint32_t)hsmbus->global_state;
          hsmbus->global_state = HAL_SMBUS_STATE_IDLE;

          /* Call the corresponding callback to inform upper layer of end of transfer */
#if defined (USE_HAL_SMBUS_REGISTER_CALLBACKS) && (USE_HAL_SMBUS_REGISTER_CALLBACKS == 1)
          hsmbus->p_master_rx_cplt_cb(hsmbus);
#else
          HAL_SMBUS_MASTER_RxCpltCallback(hsmbus);
#endif /* USE_HAL_SMBUS_REGISTER_CALLBACKS */
        }
        else
        {
          /* Nothing to do */
        }
      }
    }
    else
    {
      /* Nothing to do */
    }
  }
  else if (SMBUS_CHECK_FLAG(it_flags, LL_I2C_ISR_TC) != 0U)
  {
    if (hsmbus->xfer_count == 0U)
    {
      /* Specific use case for quick command */
      if (hsmbus->p_buf_tx == NULL)
      {
        LL_I2C_GenerateStopCondition(p_i2cx);
      }
      /* Call TxCpltCallback() if no stop mode is set */
      else if (SMBUS_GET_STOP_MODE(hsmbus) != SMBUS_AUTOEND_MODE)
      {
        /* No generate stop, to allow restart mode */
        /* The stop will be done at the end of transfer, when SMBUS_AUTOEND_MODE enable */

        /* Call the corresponding callback to inform upper layer of end of transfer */
        if (hsmbus->global_state == HAL_SMBUS_STATE_TX)
        {
          SMBUS_Disable_IRQ(hsmbus, SMBUS_TX_IT_MASK);
          hsmbus->previous_state = (uint32_t)hsmbus->global_state;
          hsmbus->global_state = HAL_SMBUS_STATE_IDLE;

          /* Call the corresponding callback to inform upper layer of end of transfer */
#if defined (USE_HAL_SMBUS_REGISTER_CALLBACKS) && (USE_HAL_SMBUS_REGISTER_CALLBACKS == 1)
          hsmbus->p_master_tx_cplt_cb(hsmbus);
#else
          HAL_SMBUS_MASTER_TxCpltCallback(hsmbus);
#endif /* USE_HAL_SMBUS_REGISTER_CALLBACKS */
        }
        else if (hsmbus->global_state == HAL_SMBUS_STATE_RX)
        {
          SMBUS_Disable_IRQ(hsmbus, SMBUS_RX_IT_MASK);
          hsmbus->previous_state = (uint32_t)hsmbus->global_state;
          hsmbus->global_state = HAL_SMBUS_STATE_IDLE;

          /* Call the corresponding callback to inform upper layer of end of transfer */
#if defined (USE_HAL_SMBUS_REGISTER_CALLBACKS) && (USE_HAL_SMBUS_REGISTER_CALLBACKS == 1)
          hsmbus->p_master_rx_cplt_cb(hsmbus);
#else
          HAL_SMBUS_MASTER_RxCpltCallback(hsmbus);
#endif /* USE_HAL_SMBUS_REGISTER_CALLBACKS */
        }
        else
        {
          /* Nothing to do */
        }
      }
      else
      {
        /* Nothing to do */
      }
    }
  }
  else
  {
    /* Nothing to do */
  }

  return HAL_OK;
}
/**
  * @brief  Interrupt Sub-Routine which handle the Interrupt Flags Slave Mode.
  * @param  hsmbus Pointer to a @ref hal_smbus_handle_t structure that contains
  *                the configuration information for the specified SMBUS.
  * @param  it_flags Value of Interrupt Flags.
  * @param  it_sources Interrupt sources enabled.
  * @retval HAL status
  */
static hal_status_t SMBUS_Slave_ISR(hal_smbus_handle_t *hsmbus, uint32_t it_flags, uint32_t it_sources)
{
  hal_smbus_slave_xfer_direction_t TransferDirection;
  uint32_t SlaveAddrCode;

  I2C_TypeDef *p_i2cx = I2C_GET_INSTANCE(hsmbus);

  if (SMBUS_CHECK_FLAG(it_flags, LL_I2C_ISR_NACKF) != 0U)
  {
    /* Check that SMBUS transfer finished */
    /* if yes, normal usecase, a NACK is sent by the HOST when Transfer is finished */
    /* Mean XferCount == 0 */
    /* So clear Flag NACKF only */
    if (hsmbus->xfer_count == 0U)
    {
      LL_I2C_ClearFlag_NACK(p_i2cx);

      SMBUS_Flush_TXDR(hsmbus);

      hsmbus->global_state = HAL_SMBUS_STATE_LISTEN;
    }
    else
    {
      /* If no, error usecase, a non-acknowledge of last data is generated by the HOST */
      LL_I2C_ClearFlag_NACK(p_i2cx);

      /* Set HAL state to "Idle" state, mean to LISTEN state */
      /* So reset slave busy state */
      hsmbus->previous_state = (uint32_t)hsmbus->global_state;
      hsmbus->global_state = HAL_SMBUS_STATE_LISTEN;

      /* Disable RX/TX interrupts, keep only ADDR interrupt */
      SMBUS_Disable_IRQ(hsmbus, SMBUS_RX_IT_MASK | SMBUS_TX_IT_MASK);

