MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_smbus.c
      /* Set error code corresponding to a non-acknowledge */
      hsmbus->last_error_codes |= HAL_SMBUS_ERROR_ACKF;

      SMBUS_Flush_TXDR(hsmbus);

      /* Call the error callback to inform upper layer */
#if defined (USE_HAL_SMBUS_REGISTER_CALLBACKS) && (USE_HAL_SMBUS_REGISTER_CALLBACKS == 1)
      hsmbus->p_error_cb(hsmbus);
#else
      HAL_SMBUS_ErrorCallback(hsmbus);
#endif /* USE_HAL_SMBUS_REGISTER_CALLBACKS */
    }
  }
  else if (SMBUS_CHECK_FLAG(it_flags, LL_I2C_ISR_ADDR) != 0U)
  {
    TransferDirection = (hal_smbus_slave_xfer_direction_t)(SMBUS_GET_DIR(hsmbus));
    SlaveAddrCode = SMBUS_GET_ADDR_MATCH(hsmbus);

    /* Disable ADDR interrupt to prevent multiple ADDRInterrupt */
    /* Other ADDRInterrupt will be treat in next listen usecase */
    SMBUS_Disable_IRQ(hsmbus, SMBUS_ADDR_IT_MASK);

    /* Call slave addr callback */
#if defined (USE_HAL_SMBUS_REGISTER_CALLBACKS) && (USE_HAL_SMBUS_REGISTER_CALLBACKS == 1)
    hsmbus->p_slave_addr_cb(hsmbus, TransferDirection, SlaveAddrCode);
#else
    HAL_SMBUS_SLAVE_AddrCallback(hsmbus, TransferDirection, SlaveAddrCode);
#endif /* USE_HAL_SMBUS_REGISTER_CALLBACKS */
  }
  else if ((SMBUS_CHECK_FLAG(it_flags, LL_I2C_ISR_RXNE) != 0U)
           || (SMBUS_CHECK_FLAG(it_flags, LL_I2C_ISR_TCR) != 0U))
  {
    if (hsmbus->global_state == HAL_SMBUS_STATE_RX_LISTEN)
    {
      /* Read data from RXDR */
      *hsmbus->p_buf_rx = LL_I2C_ReceiveData8(p_i2cx);

      /* Increment buffer pointer */
      hsmbus->p_buf_rx++;

      hsmbus->xfer_size--;
      hsmbus->xfer_count--;

      if (hsmbus->xfer_count == 1U)
      {
        /* Receive last byte, can be PEC byte in case of PEC BYTE enabled */
        /* or only the last byte of transfer */
        /* So reset the RELOAD bit mode */
        hsmbus->xfer_opt = HAL_SMBUS_XFER_FIRST_FRAME;
        SMBUS_TransferConfig(p_i2cx, 0, 1, (uint32_t)hsmbus->xfer_opt, SMBUS_NO_STARTSTOP);
      }
      else if (hsmbus->xfer_count == 0U)
      {
        /* Last byte is received, disable interrupt */
        SMBUS_Disable_IRQ(hsmbus, SMBUS_RX_IT_MASK);

        /* Remove HAL_SMBUS_STATE_SLAVE_BUSY_RX, keep only HAL_SMBUS_STATE_LISTEN */
        hsmbus->previous_state = (uint32_t)hsmbus->global_state;
        hsmbus->global_state = HAL_SMBUS_STATE_LISTEN;

        /* Call the corresponding callback to inform upper layer of end of transfer */
#if defined (USE_HAL_SMBUS_REGISTER_CALLBACKS) && (USE_HAL_SMBUS_REGISTER_CALLBACKS == 1)
        hsmbus->p_slave_rx_cplt_cb(hsmbus);
#else
        HAL_SMBUS_SLAVE_RxCpltCallback(hsmbus);
#endif /* USE_HAL_SMBUS_REGISTER_CALLBACKS */
      }
      else
      {
        /* Set reload for next bytes */
        SMBUS_TransferConfig(p_i2cx, 0, 1,
                             SMBUS_RELOAD_MODE  | ((uint32_t)hsmbus->xfer_opt & SMBUS_SENDPEC_MODE),
                             SMBUS_NO_STARTSTOP);

        /* Ack last byte read */
        LL_I2C_AcknowledgeEnable(p_i2cx);
      }
    }
    else if (hsmbus->global_state == HAL_SMBUS_STATE_TX_LISTEN)
    {
      if ((hsmbus->xfer_count != 0U) && (hsmbus->xfer_size == 0U))
      {
        if (hsmbus->xfer_count > MAX_NBYTE_SIZE)
        {
          SMBUS_TransferConfig(p_i2cx, 0, MAX_NBYTE_SIZE,
                               (SMBUS_RELOAD_MODE | ((uint32_t)hsmbus->xfer_opt & SMBUS_SENDPEC_MODE)),
                               SMBUS_NO_STARTSTOP);
          hsmbus->xfer_size = MAX_NBYTE_SIZE;
        }
        else
        {
          hsmbus->xfer_size = hsmbus->xfer_count;
          SMBUS_TransferConfig(p_i2cx, 0, (uint32_t)hsmbus->xfer_size, (uint32_t)hsmbus->xfer_opt,
                               SMBUS_NO_STARTSTOP);
          /* If PEC mode is enabled, size to transmit must be size-1 byte, corresponding to PEC byte */
          /* PEC byte is automatically sent by HW block, no need to manage it in transmit process */
          if (LL_I2C_IsEnabledSMBusPEC(p_i2cx) != 0U)
          {
            hsmbus->xfer_size--;
            hsmbus->xfer_count--;
          }
        }
      }
    }
    else
    {
      /* Nothing to do */
    }
  }
  else if (SMBUS_CHECK_FLAG(it_flags, LL_I2C_ISR_TXIS) != 0U)
  {
    /* Write data to TXDR only if XferCount not reach "0" */
    /* A TXIS flag can be set, during STOP treatment */
    /* Check if all data have already been sent */
    /* If it is the case, this last write in TXDR is not sent, correspond to a dummy TXIS event */
    if (hsmbus->xfer_count > 0U)
    {
      /* Write data to TXDR */
      LL_I2C_TransmitData8(p_i2cx, *hsmbus->p_buf_tx);

      /* Increment buffer pointer */
      hsmbus->p_buf_tx++;

      hsmbus->xfer_count--;
      hsmbus->xfer_size--;
    }

    if (hsmbus->xfer_count == 0U)
    {
      /* Last byte is Transmitted */
      /* Remove HAL_SMBUS_STATE_SLAVE_BUSY_TX, keep only HAL_SMBUS_STATE_LISTEN */
      SMBUS_Disable_IRQ(hsmbus, SMBUS_TX_IT_MASK);
      hsmbus->previous_state = (uint32_t)hsmbus->global_state;
      hsmbus->global_state = HAL_SMBUS_STATE_LISTEN;

      /* Call the corresponding callback to inform upper layer of end of transfer */
#if defined (USE_HAL_SMBUS_REGISTER_CALLBACKS) && (USE_HAL_SMBUS_REGISTER_CALLBACKS == 1)
      hsmbus->p_slave_tx_cplt_cb(hsmbus);
#else
      HAL_SMBUS_SLAVE_TxCpltCallback(hsmbus);
#endif /* USE_HAL_SMBUS_REGISTER_CALLBACKS */
    }
  }
  else
  {
    /* Nothing to do */
  }

  /* Check if STOPF is set */
  if ((SMBUS_CHECK_FLAG(it_flags, LL_I2C_ISR_STOPF) != 0U)
      && (SMBUS_CHECK_IT_SOURCE(it_sources, LL_I2C_CR1_STOPIE) != 0U))
  {
    uint32_t tmp_state = (uint32_t)hsmbus->global_state;
    if ((tmp_state == (uint32_t)HAL_SMBUS_STATE_LISTEN)
        || (tmp_state == (uint32_t)HAL_SMBUS_STATE_TX_LISTEN)
        || (tmp_state == (uint32_t)HAL_SMBUS_STATE_RX_LISTEN)
        || (tmp_state == (uint32_t)HAL_SMBUS_STATE_ABORT))
    {
      /* Store last receive data if any */
      if (SMBUS_CHECK_FLAG(it_flags, LL_I2C_ISR_RXNE) != 0U)
      {
        /* Read data from RXDR */
        *hsmbus->p_buf_rx = LL_I2C_ReceiveData8(p_i2cx);

        /* Increment buffer pointer */
        hsmbus->p_buf_rx++;

        if ((hsmbus->xfer_size > 0U))
        {
          hsmbus->xfer_size--;
          hsmbus->xfer_count--;
        }
      }

