MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_smbus.c
      /* Disable RX and TXiInterrupts */
      SMBUS_Disable_IRQ(hsmbus, SMBUS_RX_IT_MASK | SMBUS_TX_IT_MASK);

      /* Disable ADDR interrupt */
      SMBUS_Disable_IRQ(hsmbus, SMBUS_ADDR_IT_MASK);

      /* Disable address acknowledge */
      LL_I2C_AcknowledgeDisable(p_i2cx);

      /* Clear configuration register 2 */
      STM32_CLEAR_BIT(p_i2cx->CR2, I2C_CR2_SADD | I2C_CR2_HEAD10R | I2C_CR2_NBYTES
                      | LL_I2C_MODE_RELOAD | LL_I2C_REQUEST_READ);

      LL_I2C_ClearFlag_STOP(p_i2cx);

      LL_I2C_ClearFlag_ADDR(p_i2cx);

      hsmbus->xfer_opt = (hal_smbus_xfer_opt_t)0U;
      hsmbus->previous_state = (uint32_t)hsmbus->global_state;
      hsmbus->global_state = HAL_SMBUS_STATE_IDLE;

      /* Call the listen complete callback, to inform upper layer of the end of listen usecase */
#if defined (USE_HAL_SMBUS_REGISTER_CALLBACKS) && (USE_HAL_SMBUS_REGISTER_CALLBACKS == 1)
      hsmbus->p_slave_listen_cplt_cb(hsmbus);
#else
      HAL_SMBUS_SLAVE_ListenCpltCallback(hsmbus);
#endif /* USE_HAL_SMBUS_REGISTER_CALLBACKS */
    }
  }

  return HAL_OK;
}
/**
  * @brief  Manage the enabling of Interrupts.
  * @param  hsmbus Pointer to a @ref hal_smbus_handle_t structure that contains
  *                the configuration information for the specified SMBUS.
  * @param  it_request Value of @ref SMBUS_Interrupt_configuration_mask.
  */
static void SMBUS_Enable_IRQ(hal_smbus_handle_t *hsmbus, uint32_t it_request)
{
  uint32_t tmpisr = 0U;

  I2C_TypeDef *p_i2cx = I2C_GET_INSTANCE(hsmbus);

  if ((it_request & SMBUS_ALERT_IT_MASK) == SMBUS_ALERT_IT_MASK)
  {
    /* Enable ERR interrupt */
    tmpisr |= LL_I2C_CR1_ERRIE;
  }

  if ((it_request & SMBUS_ADDR_IT_MASK) == SMBUS_ADDR_IT_MASK)
  {
    /* Enable ADDR, STOP interrupt */
    tmpisr |= LL_I2C_CR1_ADDRIE | LL_I2C_CR1_STOPIE | LL_I2C_CR1_NACKIE | LL_I2C_CR1_ERRIE;
  }

  if ((it_request & SMBUS_TX_IT_MASK) == SMBUS_TX_IT_MASK)
  {
    /* Enable ERR, TC, STOP, NACK, RXI interrupt */
    tmpisr |= LL_I2C_CR1_ERRIE | LL_I2C_CR1_TCIE | LL_I2C_CR1_STOPIE | LL_I2C_CR1_NACKIE | LL_I2C_CR1_TXIE;
  }

  if ((it_request & SMBUS_RX_IT_MASK) == SMBUS_RX_IT_MASK)
  {
    /* Enable ERR, TC, STOP, NACK, TXI interrupt */
    tmpisr |= LL_I2C_CR1_ERRIE | LL_I2C_CR1_TCIE | LL_I2C_CR1_STOPIE | LL_I2C_CR1_NACKIE | LL_I2C_CR1_RXIE;
  }

  /* Enable interrupts only at the end */
  /* to avoid the risk of SMBUS interrupt handle execution before */
  /* all interrupts requested done */
  LL_I2C_EnableIT(p_i2cx, tmpisr);
}

/**
  * @brief  Manage the disabling of interrupts.
  * @param  hsmbus Pointer to a @ref hal_smbus_handle_t structure that contains
  *                the configuration information for the specified SMBUS.
  * @param  it_request Value of @ref SMBUS_Interrupt_configuration_mask.
  */
static void SMBUS_Disable_IRQ(hal_smbus_handle_t *hsmbus, uint32_t it_request)
{
  uint32_t tmpisr = 0U;
  hal_smbus_state_t tmpstate = hsmbus->global_state;

  I2C_TypeDef *p_i2cx = I2C_GET_INSTANCE(hsmbus);

  if ((tmpstate == HAL_SMBUS_STATE_IDLE) && ((it_request & SMBUS_ALERT_IT_MASK) == SMBUS_ALERT_IT_MASK))
  {
    /* Disable ERR interrupt */
    tmpisr |= LL_I2C_CR1_ERRIE;
  }

  if ((it_request & SMBUS_TX_IT_MASK) == SMBUS_TX_IT_MASK)
  {
    /* Disable TC, STOP, NACK and TXI interrupt */
    tmpisr |= LL_I2C_CR1_TCIE | LL_I2C_CR1_TXIE;

    if ((LL_I2C_IsEnabledSMBusAlert(p_i2cx) != 0U)
        && ((tmpstate != HAL_SMBUS_STATE_LISTEN)))
    {
      /* Disable ERR interrupt */
      tmpisr |= LL_I2C_CR1_ERRIE;
    }

    if ((tmpstate != HAL_SMBUS_STATE_TX_LISTEN) && (tmpstate != HAL_SMBUS_STATE_LISTEN))
    {
      /* Disable STOP and NACK interrupt */
      tmpisr |= LL_I2C_CR1_STOPIE | LL_I2C_CR1_NACKIE;
    }
  }

  if ((it_request & SMBUS_RX_IT_MASK) == SMBUS_RX_IT_MASK)
  {
    /* Disable TC, STOP, NACK and RXI interrupt */
    tmpisr |= LL_I2C_CR1_TCIE | LL_I2C_CR1_RXIE;

    if ((LL_I2C_IsEnabledSMBusAlert(p_i2cx) != 0U)
        && ((tmpstate != HAL_SMBUS_STATE_RX_LISTEN) && (tmpstate != HAL_SMBUS_STATE_LISTEN)))
    {
      /* Disable ERR interrupt */
      tmpisr |= LL_I2C_CR1_ERRIE;
    }

    if (((tmpstate != HAL_SMBUS_STATE_RX_LISTEN) && (tmpstate != HAL_SMBUS_STATE_LISTEN)))
    {
      /* Disable STOP and NACK interrupt */
      tmpisr |= LL_I2C_CR1_STOPIE | LL_I2C_CR1_NACKIE;
    }
  }

  if ((it_request & SMBUS_ADDR_IT_MASK) == SMBUS_ADDR_IT_MASK)
  {
    /* Disable ADDR and NACK interrupt */
    tmpisr |= LL_I2C_CR1_ADDRIE | LL_I2C_CR1_NACKIE;

    if (LL_I2C_IsEnabledSMBusAlert(p_i2cx) != 0U)
    {
      /* Disable ERR interrupt */
      tmpisr |= LL_I2C_CR1_ERRIE;
    }
  }

  /* Disable interrupts only at the end */
  /* to avoid a breaking situation like at "t" time */
  /* all disable interrupts request are not done */
  LL_I2C_DisableIT(p_i2cx, tmpisr);
}

/**
  * @brief  SMBUS interrupts error handler.
  * @param  hsmbus Pointer to a @ref hal_smbus_handle_t
  */
static void SMBUS_ITErrorHandler(hal_smbus_handle_t *hsmbus)
{

  I2C_TypeDef *p_i2cx = I2C_GET_INSTANCE(hsmbus);

  uint32_t itflags   = LL_I2C_READ_REG(p_i2cx, ISR);
  uint32_t itsources = LL_I2C_READ_REG(p_i2cx, CR1);
  hal_smbus_state_t tmpstate;
  uint32_t tmperror;

  /* SMBUS Bus error interrupt occurred ------------------------------------*/
  if (((itflags & LL_I2C_ISR_BERR) == LL_I2C_ISR_BERR)
      && ((itsources & LL_I2C_CR1_ERRIE) == LL_I2C_CR1_ERRIE))
  {
    hsmbus->last_error_codes |= HAL_SMBUS_ERROR_BERR;

    LL_I2C_ClearFlag_BERR(p_i2cx);
  }

  /* SMBUS Over-Run/Under-Run interrupt occurred ----------------------------------------*/
  if (((itflags & LL_I2C_ISR_OVR) == LL_I2C_ISR_OVR)
      && ((itsources & LL_I2C_CR1_ERRIE) == LL_I2C_CR1_ERRIE))
  {
    hsmbus->last_error_codes |= HAL_SMBUS_ERROR_OVR;

    LL_I2C_ClearFlag_OVR(p_i2cx);
  }

  /* SMBUS Arbitration Loss error interrupt occurred ------------------------------------*/
  if (((itflags & LL_I2C_ISR_ARLO) == LL_I2C_ISR_ARLO)
      && ((itsources & LL_I2C_CR1_ERRIE) == LL_I2C_CR1_ERRIE))
  {
    hsmbus->last_error_codes |= HAL_SMBUS_ERROR_ARLO;

    LL_I2C_ClearFlag_ARLO(p_i2cx);
  }

