MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_smbus.c
  /* SMBUS Timeout error interrupt occurred ---------------------------------------------*/
  if (((itflags & LL_I2C_ISR_TIMEOUT) == LL_I2C_ISR_TIMEOUT)
      && ((itsources & LL_I2C_CR1_ERRIE) == LL_I2C_CR1_ERRIE))
  {
    hsmbus->last_error_codes |= HAL_SMBUS_ERROR_BUSTIMEOUT;

    LL_I2C_ClearSMBusFlag_TIMEOUT(p_i2cx);
  }

  /* SMBUS Alert error interrupt occurred -----------------------------------------------*/
  if (((itflags & LL_I2C_ISR_ALERT) == LL_I2C_ISR_ALERT)
      && ((itsources & LL_I2C_CR1_ERRIE) == LL_I2C_CR1_ERRIE))
  {
    hsmbus->last_error_codes |= HAL_SMBUS_ERROR_ALERT;

    LL_I2C_ClearSMBusFlag_ALERT(p_i2cx);
  }

  /* SMBUS Packet Error Check error interrupt occurred ----------------------------------*/
  if (((itflags & LL_I2C_ISR_PECERR) == LL_I2C_ISR_PECERR)
      && ((itsources & LL_I2C_CR1_ERRIE) == LL_I2C_CR1_ERRIE))
  {
    hsmbus->last_error_codes |= HAL_SMBUS_ERROR_PECERR;

    LL_I2C_ClearSMBusFlag_PECERR(p_i2cx);
  }

  if (hsmbus->last_error_codes != HAL_SMBUS_ERROR_NONE)
  {
    SMBUS_Flush_TXDR(hsmbus);
  }

  /* Store current volatile hsmbus->last_error_codes, misra rule */
  tmperror = hsmbus->last_error_codes;

  /* Call the Error Callback in case of Error detected */
  if ((tmperror != 0U) && (tmperror != HAL_SMBUS_ERROR_ACKF))
  {
    /* Do not Reset the HAL state in case of ALERT error */
    if ((tmperror & HAL_SMBUS_ERROR_ALERT) != HAL_SMBUS_ERROR_ALERT)
    {
      /* Store current volatile hsmbus->global_state, misra rule */
      tmpstate = hsmbus->global_state;

      if ((tmpstate == HAL_SMBUS_STATE_RX_LISTEN) || (tmpstate == HAL_SMBUS_STATE_TX_LISTEN)
          || (tmpstate == HAL_SMBUS_STATE_ABORT))
      {
        /* Reset only HAL_SMBUS_STATE_SLAVE_BUSY_XX */
        /* keep HAL_SMBUS_STATE_LISTEN if set */
        hsmbus->previous_state = (uint32_t)HAL_SMBUS_STATE_IDLE;
        hsmbus->global_state = HAL_SMBUS_STATE_LISTEN;
      }
    }

    /* Call the Error callback to inform upper layer */
#if defined (USE_HAL_SMBUS_REGISTER_CALLBACKS) && (USE_HAL_SMBUS_REGISTER_CALLBACKS == 1)
    hsmbus->p_error_cb(hsmbus);
#else
    HAL_SMBUS_ErrorCallback(hsmbus);
#endif /* USE_HAL_SMBUS_REGISTER_CALLBACKS */
  }
}

/**
  * @brief  This function handles errors detection during a SMBUS communication.
  * @param  hsmbus Pointer to a @ref hal_smbus_handle_t
  * @param  timeout_ms Timeout duration in millisecond
  * @param  tick_start Tick start value
  * @retval HAL_OK     Operation completed successfully
  * @retval HAL_ERROR  Operation completed with error
  */
static hal_status_t SMBUS_IsErrorOccurred(hal_smbus_handle_t *hsmbus, uint32_t timeout_ms, uint32_t tick_start)
{
  I2C_TypeDef *p_i2cx = I2C_GET_INSTANCE(hsmbus);
  hal_status_t status = HAL_OK;
  uint32_t it_flag = LL_I2C_READ_REG(p_i2cx, ISR);
  uint32_t error_codes = 0U;
  uint32_t tick_start_local = tick_start;
  uint32_t tmp_register;
  hal_smbus_mode_t tmp_mode;

  if (STM32_IS_BIT_SET(it_flag, LL_I2C_ISR_NACKF))
  {
    LL_I2C_ClearFlag_NACK(p_i2cx);

    /* Wait until STOP flag is set or timeout occurred */
    /* AutoEnd must be initiated after AF */
    while ((LL_I2C_IsActiveFlag_STOP(p_i2cx) == 0U) && (status == HAL_OK))
    {
      /* Check for the timeout */
      if (timeout_ms != HAL_MAX_DELAY)
      {
        if (((HAL_GetTick() - tick_start_local) > timeout_ms) || (timeout_ms == 0U))
        {
          tmp_register = (uint32_t)(LL_I2C_READ_REG(p_i2cx, CR2) & I2C_CR2_STOP);
          tmp_mode = (hal_smbus_mode_t)LL_I2C_GetMode(p_i2cx);

          /* In case of I2C still busy, try to regenerate a STOP manually */
          if ((LL_I2C_IsActiveFlag_BUSY(p_i2cx) != (uint32_t)0U)
              && (tmp_register != I2C_CR2_STOP)
              && (tmp_mode == HAL_SMBUS_PERIPHERAL_MODE_HOST))
          {
            LL_I2C_GenerateStopCondition(p_i2cx);

            /* Update tick with new reference */
            tick_start_local = HAL_GetTick();
          }

          while (LL_I2C_IsActiveFlag_STOP(p_i2cx) == 0U)
          {
            /* Check for the timeout */
            if ((HAL_GetTick() - tick_start_local) > SMBUS_DEFAULT_TIMEOUT_MS)
            {
              status = HAL_ERROR;
              break;
            }
          }
        }
      }
    }

    /* In case STOP flag is detected, clear it */
    if (status == HAL_OK)
    {
      LL_I2C_ClearFlag_STOP(p_i2cx);
    }
    error_codes |= HAL_SMBUS_ERROR_ACKF;
    status = HAL_ERROR;
  }

  /* Refresh content of status register */
  it_flag = LL_I2C_READ_REG(p_i2cx, ISR);

  /* Verify if additional errors occur */
  /* Check if a Bus error occurred */
  if (STM32_IS_BIT_SET(it_flag, LL_I2C_ISR_BERR))
  {
    error_codes |= HAL_SMBUS_ERROR_BERR;
    LL_I2C_ClearFlag_BERR(p_i2cx);
    status = HAL_ERROR;
  }

  /* Check if an Over-Run/Under-Run error occurred */
  if (STM32_IS_BIT_SET(it_flag, LL_I2C_ISR_OVR))
  {
    error_codes |= HAL_SMBUS_ERROR_OVR;
    LL_I2C_ClearFlag_OVR(p_i2cx);
    status = HAL_ERROR;
  }

  /* Check if an arbitration loss error occurred */
  if (STM32_IS_BIT_SET(it_flag, LL_I2C_ISR_ARLO))
  {
    error_codes |= HAL_SMBUS_ERROR_ARLO;

    LL_I2C_ClearFlag_ARLO(p_i2cx);
    status = HAL_ERROR;
  }

  if (status != HAL_OK)
  {
    SMBUS_Flush_TXDR(hsmbus);
    I2C_RESET_CR2(p_i2cx);

    hsmbus->last_error_codes |= error_codes;
  }

  return status;
}

/**
  * @brief  Handle SMBUS communication timeout.
  * @param  hsmbus Pointer to a @ref hal_smbus_handle_t structure that contains
  *                the configuration information for the specified SMBUS.
  * @param  flag Specifies the SMBUS flag to check.
  * @param  status The new flag status (SET or RESET).
  * @param  timeout_ms Timeout duration
  * @param  tick_start Tick start value
  * @retval HAL status
  */
static hal_status_t SMBUS_WaitOnFlagUntilTimeout(hal_smbus_handle_t *hsmbus, uint32_t flag, uint32_t status,
                                                 uint32_t timeout_ms, uint32_t tick_start)
{
  I2C_TypeDef *p_i2cx = I2C_GET_INSTANCE(hsmbus);

  /* Wait until flag is set */
  while ((uint32_t)(LL_I2C_IsActiveFlag(p_i2cx, flag)) == status)
  {
    /* Check if an error is detected */
    if (SMBUS_IsErrorOccurred(hsmbus, timeout_ms, tick_start) != HAL_OK)
    {
      return HAL_ERROR;
    }

