MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_smbus.c
    /* Check for the timeout */
    if (timeout_ms != HAL_MAX_DELAY)
    {
      if (((HAL_GetTick() - tick_start) > timeout_ms) || (timeout_ms == 0U))
      {
        if ((LL_I2C_IsActiveFlag(p_i2cx, flag) == status))
        {
          hsmbus->previous_state = (uint32_t)hsmbus->global_state;
          hsmbus->global_state = HAL_SMBUS_STATE_IDLE;
          return HAL_TIMEOUT;
        }
      }
    }
  }

  return HAL_OK;
}

/**
  * @brief  SMBUS Tx data register flush process.
  * @param  hsmbus Pointer to a @ref hal_smbus_handle_t
  */
static void SMBUS_Flush_TXDR(hal_smbus_handle_t *hsmbus)
{
  I2C_TypeDef *p_i2cx = I2C_GET_INSTANCE(hsmbus);

  /* If a pending TXIS flag is set */
  /* Write a dummy data in TXDR to clear it */
  if (LL_I2C_IsActiveFlag_TXIS(p_i2cx) != 0U)
  {
    LL_I2C_TransmitData8(p_i2cx, 0x00U);
  }

  /* Flush TX register if not empty */
  if (LL_I2C_IsActiveFlag_TXE(p_i2cx) == 0U)
  {
    LL_I2C_ClearFlag_TXE(p_i2cx);
  }
}

/**
  * @brief  Handle SMBUS communication when starting transfer or during transfer (TC or TCR flag are set).
  * @param  p_i2cx Pointer to a I2C_TypeDef
  * @param  device_addr Specifies the slave address to be programmed
  * @param  size_byte Specifies the number of bytes to be programmed. It must be a value between 0 and 255.
  * @param  mode New state of the SMBUS START condition generation :
  *     @arg @ref SMBUS_RELOAD_MODE Enable Reload mode.
  *     @arg @ref SMBUS_AUTOEND_MODE Automatic end mode.
  *     @arg @ref SMBUS_SOFTEND_MODE Enable Software end mode.
  *     @arg @ref SMBUS_SENDPEC_MODE Enable Packet Error Calculation mode.
  * @param  request New state of the SMBUS START condition generation :
  *     @arg @ref SMBUS_NO_STARTSTOP Don't Generate stop and start condition.
  *     @arg @ref SMBUS_GENERATE_STOP Generate stop condition (size_byte must be set to 0).
  *     @arg @ref SMBUS_GENERATE_START_READ Generate Restart for read request.
  *     @arg @ref SMBUS_GENERATE_START_WRITE Generate Restart for write request.
  */
static void SMBUS_TransferConfig(I2C_TypeDef *p_i2cx,  uint32_t device_addr, uint32_t size_byte,
                                 uint32_t mode, smbus_start_stop_mode_t request)
{
  /* Update CR2 register */
  STM32_MODIFY_REG(p_i2cx->CR2,
                   ((I2C_CR2_SADD | I2C_CR2_NBYTES | I2C_CR2_RELOAD | I2C_CR2_AUTOEND |
                     (I2C_CR2_RD_WRN & ((uint32_t)request >> (31UL - I2C_CR2_RD_WRN_Pos))) | I2C_CR2_START |
                     I2C_CR2_STOP | I2C_CR2_PECBYTE)),
                   (uint32_t)((device_addr & I2C_CR2_SADD) | ((size_byte << I2C_CR2_NBYTES_Pos)
                                                              & I2C_CR2_NBYTES) | mode | (uint32_t)request));
}

/**
  * @brief  Convert SMBUSx OTHER_xxx from @ref hal_smbus_xfer_opt_t to their functional equivalent.
  * @param  hsmbus Pointer to a @ref hal_smbus_handle_t
  */
static void SMBUS_ConvertOtherXferOptions(hal_smbus_handle_t *hsmbus)
{
  /* If user set xfer_opt to HAL_SMBUS_XFER_OTHER_FRAME_NO_PEC   */
  /* it request implicitly to generate a restart condition */
  /* set xfer_opt to HAL_SMBUS_XFER_FIRST_FRAME                  */
  if (hsmbus->xfer_opt == HAL_SMBUS_XFER_OTHER_FRAME_NO_PEC)
  {
    hsmbus->xfer_opt = HAL_SMBUS_XFER_FIRST_FRAME;
  }
  /* else if user set xfer_opt to HAL_SMBUS_XFER_OTHER_FRAME_WITH_PEC */
  /* it request implicitly to generate a restart condition      */
  /* set xfer_opt to HAL_SMBUS_XFER_FIRST_FRAME_WITH_PEC  */
  else if (hsmbus->xfer_opt == HAL_SMBUS_XFER_OTHER_FRAME_WITH_PEC)
  {
    hsmbus->xfer_opt = HAL_SMBUS_XFER_FIRST_FRAME_WITH_PEC;
  }
  /* else if user set xfer_opt to HAL_SMBUS_XFER_OTHER_AND_LAST_FRAME_NO_PEC */
  /* it request implicitly to generate a restart condition             */
  /* then generate a stop condition at the end of transfer             */
  /* set xfer_opt to HAL_SMBUS_XFER_FIRST_AND_LAST_FRAME_NO_PEC              */
  else if (hsmbus->xfer_opt == HAL_SMBUS_XFER_OTHER_AND_LAST_FRAME_NO_PEC)
  {
    hsmbus->xfer_opt = HAL_SMBUS_XFER_FIRST_AND_LAST_FRAME_NO_PEC;
  }
  /* else if user set xfer_opt to HAL_SMBUS_XFER_OTHER_AND_LAST_FRAME_WITH_PEC */
  /* it request implicitly to generate a restart condition               */
  /* then generate a stop condition at the end of transfer               */
  /* set xfer_opt to HAL_SMBUS_XFER_FIRST_AND_LAST_FRAME_WITH_PEC              */
  else if (hsmbus->xfer_opt == HAL_SMBUS_XFER_OTHER_AND_LAST_FRAME_WITH_PEC)
  {
    hsmbus->xfer_opt = HAL_SMBUS_XFER_FIRST_AND_LAST_FRAME_WITH_PEC;
  }
  else
  {
    /* Nothing to do */
  }
}
/**
  * @}
  */

#endif /* USE_HAL_SMBUS_MODULE */
#endif /* I2C1 || I2C2 */

/**
  * @}
  */

/**
  * @}
  */
